-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /home/aarong/Projects/GITHUB/essentialmeasures/logs/log_organizeda
> ta.txt
  log type:  text
 opened on:  16 Aug 2016, 09:56:53

. 
. /****
> Spit out some tables showing where flags were indicated on race,
> hispanicity, and ancestry
> *****/
. tabulate year qancest1, row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

    Census |   Flag for Ancestr1
      year |         0          4 |     Total
-----------+----------------------+----------
      1990 |12,484,477     16,569 |12,501,046 
           |     99.87       0.13 |    100.00 
-----------+----------------------+----------
      2000 |14,081,466          0 |14,081,466 
           |    100.00       0.00 |    100.00 
-----------+----------------------+----------
     Total |26,565,943     16,569 |26,582,512 
           |     99.94       0.06 |    100.00 


. tabulate year qancest2, row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

    Census |   Flag for Ancestr2
      year |         0          4 |     Total
-----------+----------------------+----------
      1990 |12,489,764     11,282 |12,501,046 
           |     99.91       0.09 |    100.00 
-----------+----------------------+----------
     Total |12,489,764     11,282 |12,501,046 
           |     99.91       0.09 |    100.00 


. tabulate year qrace, row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |    Flag for Race,
           |  Racamind, Racasian,
           |   Racblk, Racpais,
           |    Racwht, Racoth,
    Census |     Racnum, Race
      year |         0          4 |     Total
-----------+----------------------+----------
      1990 |12,357,921    143,125 |12,501,046 
           |     98.86       1.14 |    100.00 
-----------+----------------------+----------
      2000 |13,636,093    445,373 |14,081,466 
           |     96.84       3.16 |    100.00 
-----------+----------------------+----------
      2001 | 1,171,114     21,092 | 1,192,206 
           |     98.23       1.77 |    100.00 
-----------+----------------------+----------
      2002 | 1,053,035     21,593 | 1,074,628 
           |     97.99       2.01 |    100.00 
-----------+----------------------+----------
      2003 | 1,169,515     25,413 | 1,194,928 
           |     97.87       2.13 |    100.00 
-----------+----------------------+----------
      2004 | 1,170,324     24,030 | 1,194,354 
           |     97.99       2.01 |    100.00 
-----------+----------------------+----------
      2005 | 2,823,825     54,555 | 2,878,380 
           |     98.10       1.90 |    100.00 
-----------+----------------------+----------
      2006 | 2,915,487     54,254 | 2,969,741 
           |     98.17       1.83 |    100.00 
-----------+----------------------+----------
      2007 | 2,940,293     54,369 | 2,994,662 
           |     98.18       1.82 |    100.00 
-----------+----------------------+----------
      2008 | 2,943,630     57,027 | 3,000,657 
           |     98.10       1.90 |    100.00 
-----------+----------------------+----------
      2009 | 2,984,354     46,374 | 3,030,728 
           |     98.47       1.53 |    100.00 
-----------+----------------------+----------
      2010 | 3,008,363     53,329 | 3,061,692 
           |     98.26       1.74 |    100.00 
-----------+----------------------+----------
      2011 | 3,058,317     53,700 | 3,112,017 
           |     98.27       1.73 |    100.00 
-----------+----------------------+----------
      2012 | 3,053,424     59,606 | 3,113,030 
           |     98.09       1.91 |    100.00 
-----------+----------------------+----------
     Total |54,285,695  1,113,840 |55,399,535 
           |     97.99       2.01 |    100.00 


. tabulate year qhispan, row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

    Census |    Flag for Hispan
      year |         0          4 |     Total
-----------+----------------------+----------
      1990 |12,079,677    421,369 |12,501,046 
           |     96.63       3.37 |    100.00 
-----------+----------------------+----------
      2000 |13,555,493    525,973 |14,081,466 
           |     96.26       3.74 |    100.00 
-----------+----------------------+----------
      2001 | 1,164,099     28,107 | 1,192,206 
           |     97.64       2.36 |    100.00 
-----------+----------------------+----------
      2002 | 1,049,392     25,236 | 1,074,628 
           |     97.65       2.35 |    100.00 
-----------+----------------------+----------
      2003 | 1,168,591     26,337 | 1,194,928 
           |     97.80       2.20 |    100.00 
-----------+----------------------+----------
      2004 | 1,170,432     23,922 | 1,194,354 
           |     98.00       2.00 |    100.00 
-----------+----------------------+----------
      2005 | 2,825,923     52,457 | 2,878,380 
           |     98.18       1.82 |    100.00 
-----------+----------------------+----------
      2006 | 2,917,639     52,102 | 2,969,741 
           |     98.25       1.75 |    100.00 
-----------+----------------------+----------
      2007 | 2,940,633     54,029 | 2,994,662 
           |     98.20       1.80 |    100.00 
-----------+----------------------+----------
      2008 | 2,912,864     87,793 | 3,000,657 
           |     97.07       2.93 |    100.00 
-----------+----------------------+----------
      2009 | 2,972,278     58,450 | 3,030,728 
           |     98.07       1.93 |    100.00 
-----------+----------------------+----------
      2010 | 2,994,485     67,207 | 3,061,692 
           |     97.80       2.20 |    100.00 
-----------+----------------------+----------
      2011 | 3,045,901     66,116 | 3,112,017 
           |     97.88       2.12 |    100.00 
-----------+----------------------+----------
      2012 | 3,033,437     79,593 | 3,113,030 
           |     97.44       2.56 |    100.00 
-----------+----------------------+----------
     Total |53,830,844  1,568,691 |55,399,535 
           |     97.17       2.83 |    100.00 


. 
. /***
> Replace any allocations with missing values and drop allocated race
> ****/
. replace race=. if (qrace!=0 & qrace!=.)
(1,113,840 real changes made, 1,113,840 to missing)

. replace ancestr1=. if (qancest1!=0 & qancest1!=.)
(16,569 real changes made, 16,569 to missing)

. replace ancestr1d=. if (qancest1!=0 & qancest1!=.)
(16,569 real changes made, 16,569 to missing)

. replace ancestr2=. if  (qancest2!=0 & qancest2!=.)
(11,282 real changes made, 11,282 to missing)

. replace ancestr2d=. if (qancest2!=0 & qancest2!=.)
(11,282 real changes made, 11,282 to missing)

. replace hispand=. if (qhispan!=0 & qhispan!=.)                        
(1,568,691 real changes made, 1,568,691 to missing)

. 
. //remove any responses that had race (ancestry will just show up as none)
. drop if race==. | hispand==.
(2,204,313 observations deleted)

. 
. /*********************
> Before I code the ancestry groups, I want to do a little collapsing of
> the detailed ancestries. The general code collapses too many cases
> that could mark important distinctions (e.g. German vs. Pennsylvania
> German) so I think the goal should be to not aggregate unless
> necessary from the detailed codes. (see the testancestry.csv for
> details on where collapsing happends between the general and detailed
> codes in the data I have here). However, some ancestries are either so
> small that they really need to be collapsed if possible (e.g. Occitan
> has one person, so should be collapsed to French) or cases that seem
> to be alternate ways to say the same thing (e.g. German and Germanic).
> 
> Please note that this collapsing is only done for ancestries that I
> actually have from 1990-2012, not on the logical set of all possible
> cases, so if this analysis is extended to other years, this will need
> to be checked again.
> *********************/
. 
. //Occitan (1 case) becomes French
. replace ancestr1d = 261 if ancestr1d==262
(1 real change made)

. replace ancestr2d = 261 if ancestr2d==262
(0 real changes made)

. 
. //Germanic becomes German
. replace ancestr1d = 321 if ancestr1d==329
(2,215 real changes made)

. replace ancestr2d = 321 if ancestr2d==329
(519 real changes made)

. 
. //Rusyn becomes Carpatho Rusyn
. replace ancestr1d = 1051 if ancestr1d==1052
(33 real changes made)

. replace ancestr2d = 1051 if ancestr2d==1052
(47 real changes made)

. 
. //Canal Zone (2 cases) become Panamanian
. replace ancestr1d = 2251 if ancestr1d==2252
(2 real changes made)

. replace ancestr2d = 2251 if ancestr2d==2252
(0 real changes made)

. 
. //Arabic becomes Arab
. replace ancestr1d = 4950 if ancestr1d==4951
(16,013 real changes made)

. replace ancestr2d = 4950 if ancestr2d==4951
(2,121 real changes made)

. 
. //East Indian becomes India
. replace ancestr1d = 6151 if ancestr1d==6152
(9,696 real changes made)

. replace ancestr2d = 6151 if ancestr2d==6152
(1,169 real changes made)

. 
. /********
> Here I will drop any problematic ancestries for whom race is particularly 
> ambiguous. This will not include the "American" and "Mixture" groups, but 
> small groups of other national origins groups who themselves are diverse.  
> 
> Based on an examination of the hispanicity responses, I decided to drop Basqu
> e,
> Spanish Basque, Spaniard, and Spanish. In each case, the majority did
> not write in a consistent hispanic identification and in some cases,
> substantial numbers of Mexicans identified as only Spaniard or
> Spanish. I think this reflects the uncertainty of the hispanicity
> question and we are getting a heterogenous mix here of ancestral
> meaning, so I am dropping these cases. For similar reasons, I am
> dropping Brazilians. I have them listed as hispanic on big race, but
> very few actually report as such and the Census doesn't want them
> too. Plus, this country is internally diverse in a way that isn't
> written over by latino ancestry as it is for Columbians and Dominicans
> for example. Finally, I am also going to drop a few categories that
> are actually "not elsewhere classified" responses because these are
> heterogenous groupings.
> 
> ********/
. drop if ancestr1d==53 | ancestr1d==54 | (ancestr1d>=2000 & ancestr1d<=2062) |
>  ancestr1d==2910 | ancestr2d==53 | ancestr2d==54 | (ancestr2d>=2000 & ancestr
> 2d<=2062) | ancestr2d==2910 //spanish ancestries (including basque)
(469,295 observations deleted)

. drop if (ancestr1>=570 & ancestr1<=572) | (ancestr2>=570 & ancestr2<=572) //S
> outh Africans
(7,907 observations deleted)

. drop if ancestr1d==3600 | ancestr2d==3600 //Brazilian
(34,579 observations deleted)

. drop if (ancestr1d>=1810 & ancestr1d<=1950) | (ancestr2d>=1810 & ancestr2d<=1
> 950) //european NEC
(551,453 observations deleted)

. drop if ancestr1d==2960 | ancestr2d==2960 //Other Hispanic
(124 observations deleted)

. drop if ancestr1d==3370 | ancestr2d==3370 //Other West Indian
(1,996 observations deleted)

. drop if ancestr1d==5950 | ancestr2d==5950 //Other SS African
(6,619 observations deleted)

. drop if ancestr1d==7960 | ancestr2d==7960 //Other Asian
(3,019 observations deleted)

. drop if ancestr1d==8700 | ancestr2d==8700 //Other PI
(2,583 observations deleted)

. 
. /**************
> MESO-RACIAL ANCESTRY CODES
> 1 - European including Spanish
> 2 - African American
> 3 - American Indian (including South, Central American Indian, Inuit, Eskimo,
>  etc.)
> 4 - East and Southeast Asian
> 5 - Pacific Islander (put Australian and New Zealander into European category
> )
> 6 - Latin America
> 7 - non-Latin Caribbean
> 8 - North African and Middle Eastern
> 9 - Sub-Saharan African
> 10- South Asian
> 11- American or other ambigious (including Canadian)
> 12- mixture
> 13 - None
> */
. 
. generate rancestry1=13

. replace rancestry1=1 if ancestr1d<2100 | ancestr1d==2910 | ancestr1d==8000 | 
> ancestr1d==8030 | (ancestr1d>=9240 & ancestr1d<=9362) //European
(28,267,549 real changes made)

. replace rancestry1=7 if ancestr1d>=3000 & ancestr1d<4000 //non-Latin Caribbea
> n
(289,455 real changes made)

. replace rancestry1=6 if (ancestr1d>=2100 & ancestr1d<3000 & ancestr1d!=2910) 
> | ancestr1d==3600 //Latin American
(4,912,692 real changes made)

. replace rancestry1=8 if (ancestr1d>=4000 & ancestr1d<5000) //North Africa/Mid
> dle East
(349,258 real changes made)

. replace rancestry1=9 if (ancestr1d>=5000 & ancestr1d<6000) //Sub-Saharan Afri
> can
(243,139 real changes made)

. replace rancestry1=10 if (ancestr1d>=6000 & ancestr1d<7000) //South Asian
(348,629 real changes made)

. replace rancestry1=4 if (ancestr1d>=7000 & ancestr1d<8000) //East and SE Asia
> n
(1,640,464 real changes made)

. replace rancestry1=5 if (ancestr1d>8000 & ancestr1d<9000) & ancestr1d!=8030 /
> /Pacific Islander
(95,473 real changes made)

. replace rancestry1=2 if (ancestr1d>=9000 & ancestr1d<=9020) //African America
> n
(4,302,072 real changes made)

. replace rancestry1=3 if (ancestr1d>=9130 & ancestr1d<=9230) //American Indian
(1,195,394 real changes made)

. replace rancestry1=11 if (ancestr1d>=9390 & ancestr1d<=9940) | (ancestr1d>=93
> 10 & ancestr1d<9350) //American
(3,829,857 real changes made)

. replace rancestry1=12 if (ancestr1d==9950) //Mixed
(104,518 real changes made)

. 
. generate rancestry2=13

. replace rancestry2=1 if ancestr2d<2100 | ancestr2d==2910 | ancestr2d==8000 | 
> ancestr2d==8030 | (ancestr2d>=9240 & ancestr2d<=9362)
(12,724,777 real changes made)

. replace rancestry2=7 if ancestr2d>=3000 & ancestr2d<4000
(32,141 real changes made)

. replace rancestry2=6 if (ancestr2d>=2100 & ancestr2d<3000 & ancestr2d!=2910) 
> | ancestr2d==3600
(275,250 real changes made)

. replace rancestry2=8 if (ancestr2d>=4000 & ancestr2d<5000)
(60,946 real changes made)

. replace rancestry2=9 if (ancestr2d>=5000 & ancestr2d<6000)
(15,062 real changes made)

. replace rancestry2=10 if (ancestr2d>=6000 & ancestr2d<7000)
(15,613 real changes made)

. replace rancestry2=4 if (ancestr2d>=7000 & ancestr2d<8000)
(146,421 real changes made)

. replace rancestry2=5 if (ancestr2d>8000 & ancestr2d<9000) & ancestr2d!=8030
(22,228 real changes made)

. replace rancestry2=2 if (ancestr2d>=9000 & ancestr2d<=9020) 
(82,872 real changes made)

. replace rancestry2=3 if (ancestr2d>=9130 & ancestr2d<=9230)
(774,046 real changes made)

. replace rancestry2=11 if (ancestr2d>=9390 & ancestr2d<=9940) | (ancestr2d>=93
> 10 & ancestr2d<9350)
(84,440 real changes made)

. replace rancestry2=12 if (ancestr2d==9950)
(3,817 real changes made)

. label define ancestryshort 1 "W" 6 "H" 7 "C" 8 "ME" 9 "SSA" 10 "SA" 4 "EA" 5 
> "PI" 2 "B" 3 "AI" 11 "A" 12 "M" 13 "None"

. label values rancestry1 ancestryshort

. label values rancestry2 ancestryshort

. 
. //check to see if we have a 13 for first ancestry and not for second and swit
> ch them if so
. //We also need to be sure to switch the underlying individual ancestries
. gen switchanc = rancestry1==13 & rancestry2!=13

. replace rancestry1=rancestry2 if switchanc
(16,610 real changes made)

. replace rancestry2=13 if switchanc
(16,610 real changes made)

. replace ancestr1=ancestr2 if switchanc
(16,610 real changes made)

. replace ancestr2=. if switchanc
(16,610 real changes made, 16,610 to missing)

. replace ancestr1d=ancestr2d if switchanc
(16,610 real changes made)

. replace ancestr2d=. if switchanc
(16,610 real changes made, 16,610 to missing)

. drop switchanc

. 
. //I also want to switch it so that any American or Mixed comes after a valid 
> ancestry
. gen rancestry1dupe = rancestry1

. gen ancestr1dupe = ancestr1
(9,700 missing values generated)

. gen ancestr1ddupe = ancestr1d
(9,700 missing values generated)

. gen switchanc = (rancestry1==11 | rancestry1==12) & rancestry2<11

. replace rancestry1=rancestry2 if switchanc
(43,751 real changes made)

. replace rancestry2=rancestry1dupe if switchanc
(43,751 real changes made)

. replace ancestr1=ancestr2 if switchanc
(43,751 real changes made)

. replace ancestr2=ancestr1dupe if switchanc
(43,751 real changes made)

. replace ancestr1d=ancestr2d if switchanc
(43,751 real changes made)

. replace ancestr2d=ancestr1ddupe if switchanc
(43,751 real changes made)

. drop rancestry1dupe ancestr1dupe ancestr1ddupe switchanc

. 
. /*******
> BIG RACIAL ANCESTRY CODES
> 1 - White - European +Middle East/North Africa
> 2 - Black - African American+African+Afro-Caribbean
> 3 - Indigenous - AmIndian+PacIslander
> 4 - Asian - East/Se Asian + South Asian
> 5 - Latino - Latino
> *******/
. generate rancestry1s = .
(52,117,647 missing values generated)

. replace rancestry1s = 1 if rancestry1==1 | rancestry1==8 //White from Europea
> n and Middle East/North African
(28,574,118 real changes made)

. replace rancestry1s = 2 if rancestry1==2 | rancestry1==9 | rancestry1==7 //Bl
> ack from African-American, African, and Afro-Caribbean
(4,836,489 real changes made)

. replace rancestry1s = 3 if rancestry1==3 | rancestry1==5 //Indigenous from Am
> erican Indian and Pacific Islander
(1,294,820 real changes made)

. replace rancestry1s = 4 if rancestry1==4 | rancestry1==10 //Asian from East/S
> E Asian and South Asian
(1,991,405 real changes made)

. replace rancestry1s = 5 if rancestry1==6 //Latino from Latino
(4,915,281 real changes made)

. 
. generate rancestry2s = .
(52,117,647 missing values generated)

. replace rancestry2s = 1 if rancestry2==1 | rancestry2==8
(12,697,978 real changes made)

. replace rancestry2s = 2 if rancestry2==2 | rancestry2==9 | rancestry2==7
(128,252 real changes made)

. replace rancestry2s = 3 if rancestry2==3 | rancestry2==5 
(792,321 real changes made)

. replace rancestry2s = 4 if rancestry2==4 | rancestry2==10
(159,722 real changes made)

. replace rancestry2s = 5 if rancestry2==6
(272,661 real changes made)

. 
. //now do a combined racial ancestry where the person is listed as Multiple if
>  the
. //second big race ancestry is not missing and isn't the same as the first.
. generate raceanc = rancestry1s
(10,505,534 missing values generated)

. replace raceanc=6 if rancestry1s!=. & rancestry2s!=. & rancestry1s!=rancestry
> 2s
(1,867,024 real changes made)

. label define sracelbl 1 "White" 2 "Black" 3 "Indigenous" 4 "Asian" 5 "Latino"
>  6 "Multiple"

. label values rancestry1s sracelbl

. label values rancestry2s sracelbl

. label values raceanc sracelbl

. 
. //lets to another big racial ancestry varaible that breaks out
. //the multiple category into each specific combo
. generate raceancd = raceanc
(10,505,534 missing values generated)

. replace raceancd = 16 if raceancd==6 //initially put all multiples here
(1,867,024 real changes made)

. replace raceancd = 6 if (rancestry1s==1 & rancestry2s==2) | (rancestry1s==2 &
>  rancestry2s==1) //White/Black
(102,692 real changes made)

. replace raceancd = 7 if (rancestry1s==1 & rancestry2s==3) | (rancestry1s==3 &
>  rancestry2s==1) //White/Indig
(1,085,535 real changes made)

. replace raceancd = 8 if (rancestry1s==1 & rancestry2s==4) | (rancestry1s==4 &
>  rancestry2s==1) //White/Asian
(123,833 real changes made)

. replace raceancd = 9 if (rancestry1s==1 & rancestry2s==5) | (rancestry1s==5 &
>  rancestry2s==1) //White/Latino
(305,887 real changes made)

. replace raceancd = 10 if (rancestry1s==2 & rancestry2s==3) | (rancestry1s==3 
> & rancestry2s==2) //Black/Indig
(82,040 real changes made)

. replace raceancd = 11 if (rancestry1s==2 & rancestry2s==4) | (rancestry1s==4 
> & rancestry2s==2) //Black/Asian
(17,667 real changes made)

. replace raceancd = 12 if (rancestry1s==2 & rancestry2s==5) | (rancestry1s==5 
> & rancestry2s==2) //Black/Latino
(46,027 real changes made)

. replace raceancd = 13 if (rancestry1s==3 & rancestry2s==4) | (rancestry1s==4 
> & rancestry2s==3) //Indig/Asian
(31,045 real changes made)

. replace raceancd = 14 if (rancestry1s==3 & rancestry2s==5) | (rancestry1s==5 
> & rancestry2s==3) //Indig/Latino
(42,537 real changes made)

. replace raceancd = 15 if (rancestry1s==4 & rancestry2s==5) | (rancest ry1s==5
>  & rancestry2s==4) //Asian/Latino
(29,761 real changes made)

. replace raceancd = . if rancestry1s==. & rancestry2s==.
(0 real changes made)

. label define raceancdlbl 1 "White" 2 "Black" 3 "Indig" 4 "Asian" 5 "Latino" 6
>  "White/Black" 7 "White/Indig" 8 "White/Asian" 9 "White/Latino" 10 "Black/Ind
> ig" 11 "Black/Asian" 12 "Black/Latino" 13 "Indig/Asian" 14 "Indig/Latino" 15 
> "Asian/Latino" 16 "Other"

. label values raceancd raceancdlbl

. 
. /******
> Now code in the detailed race codes that correspond to the same big
> race groups. Just like for ancestry, I will code one that just
> collapses multiple races and one that breaks them out into combos
> *******/
. 
. //First code a simple latino dummy
. //Note, I take out the Spaniard categories from this variable
. generate latino = hispand!=0 & (hispand<450 | hispand>459)

. 
. //first code the detailed one and then use that to code back the short one
. //including cases of Big race/other, and whether that constitutes a multiraci
> al response
. //also make sure I pick up all asian and PI responses that are same big race
. generate raceombd = .
(52,117,647 missing values generated)

. replace raceombd = 1 if raced<200 //White
(41,236,012 real changes made)

. replace raceombd = 2 if raced>=200 & raced<300 //Black
(5,400,746 real changes made)

. replace raceombd = 4 if (raced>=400 & race<700) | raced==869 | raced==887 //A
> sian (take out PIs later)
(4,986,176 real changes made)

. replace raceombd = 3 if (raced>=300 & raced<400) | raced==630 | raced==634 | 
> raced==652 | (raced>=680 & raced<=699) | raced==855 //Indig
(563,253 real changes made)

. replace raceombd = 16 if raced>=700 //others and other multiples
(3,010,415 real changes made)

. //Now break out the multiples
. replace raceombd = 6 if raced==801 //White/black
(155,735 real changes made)

. replace raceombd = 7 if raced==802 | (raced>=820 & raced<=825) //White/Indig
(230,040 real changes made)

. replace raceombd = 8 if raced>=810 & raced<=819 //White/Asian
(151,157 real changes made)

. replace raceombd = 10 if raced==830 | (raced>=840 & raced<=842) //Black/Indig
(32,032 real changes made)

. replace raceombd = 11 if raced>=831 & raced<=838 //Black/Asian
(15,251 real changes made)

. replace raceombd = 13 if (raced>=850 & raced<=854) | (raced>=861 & raced<=868
> ) //Indig/Asian
(23,766 real changes made)

. //one drop latinos
. replace raceombd = 5 if latino
(5,391,564 real changes made)

. 
. /**
> Now I am going to do something a bit hacky. Multiracial ancestry
> latinos who check a race box (or more than one) and hispanic may be
> trying to indicate a multiracial ancestry, but we can't tell given the
> way the question is worded. I am going to check the actual race
> response for these individuals and if they indicated a race that was
> consistent with their multiracial ancestry then assign them taht
> multiracial category. This is not perfect, but I think will allow a
> closer comparison between multiple latino ancestry responses and other
> multiple ancestry respones. An alternative would be to code each of
> the six responses into latino and non-latino versions, but I feel that
> will artificially inflate entropy for latino groups, relative to what
> I am trying to get at. 
> **/
. 
. //White/Latino
. replace raceombd=9 if raceancd==9 & latino & (raced==100 | (raced>=801 & race
> d<=827) | (raced>=901 & raced<=926) | (raced>=950 & raced<=964) | (raced>=980
>  & raced<=981) | (raced>=990 & raced<=991))
(203,100 real changes made)

. //Black/Latino
. replace raceombd=12 if raceancd==12 & latino & (raced==200 | raced==801 | (ra
> ced>=830 & raced<=845) | (raced>=901 & raced<=903) | (raced>=930 & raced<=935
> ) | (raced>=950 & raced<=955) | (raced>=970 & raced<=973) | (raced>=980 & rac
> ed<=983) | raced==986 | raced==990 | raced==991)
(31,829 real changes made)

. //Indig/Latino
. replace raceombd=14 if raceancd==14 & latino & ((raced>=300 & raced<=399) | (
> raced>=680 & raced<=699) | raced==802 | (raced>=820 & raced<=825) | raced==83
> 0 | (raced>=840 & raced<=842) | raced==855 | (raced>=860 & raced<=868) | (rac
> ed>=890 & raced<=899) | raced==901 | raced==903 | (raced>=906 & raced<=907) |
>  (raced>=910 & raced<=915) | raced==925 | (raced>=930 & raced<=933) | (raced>
> =940 & raced<=944) | (raced>=950 & raced<=953) | (raced>=955 & raced<=976) | 
> (raced>=980 & raced<=986) | raced==990 | raced==991)
(17,160 real changes made)

. //Asian/Latino
. replace raceombd=15 if raceancd==15 & latino & ((raced>=400 & raced<=679) | (
> raced>=810 & raced<=819) | (raced>=831 & raced<=838) | (raced>=850 & raced<=8
> 54) | (raced>=860 & raced<=887) | raced==902 | raced==905 | (raced>=910 & rac
> ed<=930) | (raced>=933 & raced<=934) | (raced>=940 & raced<=941) | (raced>=94
> 3 & raced<=944) | raced==950 | (raced>=953 & raced<=954) | (raced>=960 & race
> d<=961) | (raced>=963 & raced<=971) | (raced>=973 & raced<=981) | (raced>=983
>  & raced<=985) | raced==990 | raced==991)
(19,407 real changes made)

. 
. label values raceombd raceancdlbl

. 
. generate raceshort = raceombd

. //collapse multiples
. replace raceshort = 6 if raceshort>=6
(897,418 real changes made)

. //take back out the non-latino others
. replace raceshort = 7 if raced==700 & !latino
(73,890 real changes made)

. label define srace2lbl 1 "White" 2 "Black" 3 "Indigenous" 4 "Asian" 5 "Latino
> " 6 "Multiple" 7 "Other"

. label values raceshort srace2lbl

. 
. /*********
> Now code some other variables
> and save the full data
> *********/
. generate yearint = year

. replace yearint=2002 if year==2001 | year==2002 | year==2003
(2,262,895 real changes made)

. replace yearint=2005 if year==2004 | year==2005 | year==2006
(3,954,289 real changes made)

. replace yearint=2008 if year==2007 | year==2008 | year==2009
(5,709,140 real changes made)

. replace yearint=2011 if year>2009
(5,797,402 real changes made)

. generate college = educd>=101

. replace college = . if educd<2
(1,963,747 real changes made, 1,963,747 to missing)

. generate female = sex==2

. generate noancestry = rancestry1==13

. generate agectr = age-25

. generate agectrsq = agectr^2

. generate foreign = bpl>120

. replace bpl=0 if bpl<120
(46,776,402 real changes made)

. 
. 
. //Create a weight variable that divides by the mean of perwt in each year
. //this is useful for some aggregations to give aggregated counts that add up
. //to the actual sample total
. gen samwt=.
(52,117,647 missing values generated)

. replace samwt = perwt/20 if year==1980
(0 real changes made)

. replace samwt = perwt/19.84695 if year==1990
(11,812,244 real changes made)

. replace samwt = perwt/19.98527 if year==2000
(13,089,603 real changes made)

. replace samwt = perwt/232.406 if year==2001
(1,130,817 real changes made)

. replace samwt = perwt/261.2228 if year==2002
(1,018,596 real changes made)

. replace samwt = perwt/236.8774 if year==2003
(1,132,078 real changes made)

. replace samwt = perwt/239.1879 if year==2004
(1,133,310 real changes made)

. replace samwt = perwt/100.1948 if year==2005
(2,732,113 real changes made)

. replace samwt = perwt/100.8164 if year==2006
(2,820,979 real changes made)

. replace samwt = perwt/100.7196 if year==2007
(2,839,080 real changes made)

. replace samwt = perwt/100.3311 if year==2008
(2,807,163 real changes made)

. replace samwt = perwt/101.298 if year==2009
(2,870,060 real changes made)

. replace samwt = perwt/101.0388 if year==2010
(2,881,994 real changes made)

. replace samwt = perwt/100.1254 if year==2011
(2,934,202 real changes made)

. replace samwt = perwt/100.8387 if year==2012
(2,915,408 real changes made)

. 
. //an adjusted weight for the collapsed years
. generate perwtint = perwt

. replace perwtint = perwt/3 if year>2000
(27,215,800 real changes made)

. 
. 
. /**********
> Output some tables for checking
> *********/
.     
. //get frequency of number of ancestries for figure
. gen nanc = 0

. replace nanc = 1 if rancestry1!=13 & rancestry2==13
(31,319,947 real changes made)

. replace nanc = 2 if rancestry1!=13 & rancestry2!=13
(14,182,866 real changes made)

. tabulate yearint nanc, row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |               nanc
   yearint |         0          1          2 |     Total
-----------+---------------------------------+----------
      1990 | 1,195,043  7,062,086  3,555,115 |11,812,244 
           |     10.12      59.79      30.10 |    100.00 
-----------+---------------------------------+----------
      2000 | 2,525,637  7,558,678  3,005,288 |13,089,603 
           |     19.29      57.75      22.96 |    100.00 
-----------+---------------------------------+----------
      2002 |   335,911  1,976,907    968,673 | 3,281,491 
           |     10.24      60.24      29.52 |    100.00 
-----------+---------------------------------+----------
      2005 |   617,612  4,150,534  1,918,256 | 6,686,402 
           |      9.24      62.07      28.69 |    100.00 
-----------+---------------------------------+----------
      2008 |   909,771  5,226,286  2,380,246 | 8,516,303 
           |     10.68      61.37      27.95 |    100.00 
-----------+---------------------------------+----------
      2011 | 1,030,860  5,345,456  2,355,288 | 8,731,604 
           |     11.81      61.22      26.97 |    100.00 
-----------+---------------------------------+----------
     Total | 6,614,834 31,319,947 14,182,866 |52,117,647 
           |     12.69      60.09      27.21 |    100.00 


. 
. //now put together some tables that check and make sure everything is coming 
> out as expected
. table raced raceshort, missing

-----------------------------------------------------------------------------
                                         |             raceshort             
                 Race [detailed version] |      White       Black  Indigenous
-----------------------------------------+-----------------------------------
                                   White |   3.83e+07           .           .
                             Black/Negro |          .     5300690           .
                                  Apache |          .           .      10,094
                               Blackfoot |          .           .       6,996
                                Cherokee |          .           .      60,359
                                Cheyenne |          .           .       2,193
                               Chickasaw |          .           .       4,252
                                Chippewa |          .           .      22,969
                                 Choctaw |          .           .      17,599
                                Comanche |          .           .       1,995
                                   Creek |          .           .       8,438
                                    Crow |          .           .       1,208
                                Iroquois |          .           .       9,876
                                   Kiowa |          .           .         489
                                  Lumbee |          .           .      10,221
                                  Navajo |          .           .      56,428
                                   Osage |          .           .         473
                                  Paiute |          .           .       2,092
                                    Pima |          .           .       2,319
                              Potawatomi |          .           .       3,597
                                  Pueblo |          .           .      14,200
                                Seminole |          .           .       2,838
                                Shoshone |          .           .         551
                                   Sioux |          .           .      22,314
       Tlingit (Tlingit_Haida, 2000/ACS) |          .           .       3,609
                          Tohono O Odham |          .           .       3,338
                 All other tribes (1990) |          .           .      19,222
                                    Hopi |          .           .         190
                                Delaware |          .           .         573
                   Latin American Indian |          .           .         413
                      Puget Sound Salish |          .           .       2,753
                                  Yakama |          .           .         566
                                   Yaqui |          .           .       1,739
                                Colville |          .           .         673
                                   Houma |          .           .         469
                               Menominee |          .           .         533
                                   Yuman |          .           .         906
                   South American Indian |          .           .           3
                 Mexican American Indian |          .           .          49
     Other Amer. Indian tribe (2000,ACS) |          .           .      55,366
       2+ Amer. Indian tribes (2000,ACS) |          .           .      11,491
                      Alaskan Athabaskan |          .           .       4,331
                                   Aleut |          .           .       3,762
                                  Eskimo |          .           .      17,213
                                 Inupiat |          .           .         669
                                  Yup'ik |          .           .         965
 Other Alaska Native tribe(s) (2000,ACS) |          .           .       2,167
Both Am. Ind. and Alaska Native (2000,AC |          .           .       5,687
                     Tribe not specified |          .           .      43,539
                                 Chinese |          .           .           .
                               Taiwanese |          .           .           .
                   Chinese and Taiwanese |          .           .           .
                                Japanese |          .           .           .
                                Filipino |          .           .           .
          Asian Indian (Hindu 1920_1940) |          .           .           .
                                  Korean |          .           .           .
                                Hawaiian |          .           .      28,999
                              Vietnamese |          .           .           .
                               Bhutanese |          .           .           .
                              Mongolian  |          .           .           .
                                Nepalese |          .           .           .
                               Cambodian |          .           .           .
                                   Hmong |          .           .           .
                                 Laotian |          .           .           .
                                    Thai |          .           .           .
                             Bangladeshi |          .           .           .
                                 Burmese |          .           .           .
                              Indonesian |          .           .           .
                               Malaysian |          .           .           .
                                Okinawan |          .           .           .
                               Pakistani |          .           .           .
                              Sri Lankan |          .           .           .
                     Other Asian, n.e.c. |          .           .           .
                    Asian, not specified |          .           .           .
                    Chinese and Japanese |          .           .           .
                    Chinese and Filipino |          .           .           .
                  Chinese and Vietnamese |          .           .           .
              Chinese and Asian write_in |          .           .           .
                   Japanese and Filipino |          .           .           .
         Asian Indian and Asian write_in |          .           .           .
           Other Asian race combinations |          .           .           .
                                  Samoan |          .           .      11,393
                                Tahitian |          .           .          36
                                  Tongan |          .           .       4,402
                 Other Polynesian (1990) |          .           .         130
    1+ other Polynesian races (2000,ACS) |          .           .       1,378
                      Guamanian/Chamorro |          .           .       8,010
               Northern Mariana Islander |          .           .          37
                                 Palauan |          .           .          61
                Other Micronesian (1990) |          .           .         268
   1+ other Micronesian races (2000,ACS) |          .           .       2,152
                                  Fijian |          .           .         654
                 Other Melanesian (1990) |          .           .           2
    1+ other Melanesian races (2000,ACS) |          .           .       2,088
          2+ PI races from 2+ PI regions |          .           .         305
                  Pacific Islander, n.s. |          .           .       2,658
                      Other race, n.e.c. |          .           .           .
                         White and Black |          .           .           .
                          White and AIAN |          .           .           .
                       White and Chinese |          .           .           .
                      White and Japanese |          .           .           .
                      White and Filipino |          .           .           .
                  White and Asian Indian |          .           .           .
                        White and Korean |          .           .           .
                    White and Vietnamese |          .           .           .
                White and Asian write_in |          .           .           .
           White and other Asian race(s) |          .           .           .
      White and two or more Asian groups |          .           .           .
               White and Native Hawaiian |          .           .           .
                        White and Samoan |          .           .           .
                     White and Guamanian |          .           .           .
                   White and PI write_in |          .           .           .
              White and other PI race(s) |          .           .           .
           White and other race write_in |          .           .           .
            White and other race, n.e.c. |          .           .           .
                          Black and AIAN |          .           .           .
                       Black and Chinese |          .           .           .
                      Black and Japanese |          .           .           .
                      Black and Filipino |          .           .           .
                  Black and Asian Indian |          .           .           .
                        Black and Korean |          .           .           .
                Black and Asian write_in |          .           .           .
           Black and other Asian race(s) |          .           .           .
                   Black and PI write_in |          .           .           .
              Black and other PI race(s) |          .           .           .
           Black and other race write_in |          .           .           .
             AIAN and Filipino (2000 1%) |          .           .           .
                   AIAN and Asian Indian |          .           .           .
            AIAN and other Asian race(s) |          .           .           .
                             AIAN and PI |          .           .           .
            AIAN and other race write_in |          .           .           .
                    Chinese and Hawaiian |          .           .           .
   Chinese, Filipino, Hawaiian (2000 1%) |          .           .           .
         Japanese and Hawaiian (2000 1%) |          .           .           .
                   Filipino and Hawaiian |          .           .           .
                Filipino and PI write_in |          .           .           .
          Asian write_in and PI write_in |          .           .           .
      Other Asian race(s) and PI race(s) |          .           .           .
               Japanese and Korean (ACS) |          .           .           .
         Chinese and other race write_in |          .           .           .
        Japanese and other race write_in |          .           .           .
        Filipino and other race write_in |          .           .           .
    Asian Indian and other race write_in |          .           .           .
  Asian write_in and other race write_in |          .           .           .
Other Asian race(s) and other race write |          .           .           .
                      Chinese and Korean |          .           .           .
            PI and other race write_in:  |          .           .           .
     PI write_in and other race write_in |          .           .           .
Other PI race(s) and other race write_in |          .           .           .
         Native Hawaiian or PI other rac |          .           .           .
                      White, Black, AIAN |          .           .           .
                     White, Black, Asian |          .           .           .
                        White, Black, PI |          .           .           .
       White, Black, other race write_in |          .           .           .
                      White, AIAN, Asian |          .           .           .
                         White, AIAN, PI |          .           .           .
        White, AIAN, other race write_in |          .           .           .
                White, Chinese, Hawaiian |          .           .           .
White, Chinese, Filipino, Hawaiian (2000 |          .           .           .
     White, Japanese, Hawaiian (2000 1%) |          .           .           .
               White, Filipino, Hawaiian |          .           .           .
  Other White, Asian race(s), PI race(s) |          .           .           .
                White, AIAN and Filipino |          .           .           .
              White, Black, and Filipino |          .           .           .
       White, Asian, other race write_in |          .           .           .
White, Filipino, other race write_in (20 |          .           .           .
White, Asian write_in, other race write_ |          .           .           .
Other White, Asian race(s), other race w |          .           .           .
          White, PI, other race write_in |          .           .           .
                      Black, AIAN, Asian |          .           .           .
                         Black, AIAN, PI |          .           .           .
        Black, AIAN, other race write_in |          .           .           .
                        Black, Asian, PI |          .           .           .
       Black, Asian, other race write_in |          .           .           .
          Black, PI, other race write_in |          .           .           .
                         AIAN, Asian, PI |          .           .           .
        AIAN, Asian, other race write_in |          .           .           .
           AIAN, PI, other race write_in |          .           .           .
          Asian, PI, other race write_in |          .           .           .
Asian (Chinese, Japanese, Korean, Vietna |          .           .           .
               White, Black, AIAN, Asian |          .           .           .
                  White, Black, AIAN, PI |          .           .           .
 White, Black, AIAN, other race write_in |          .           .           .
                 White, Black, Asian, PI |          .           .           .
White, Black, Asian, other race write_in |          .           .           .
   White, Black, PI, other race write_in |          .           .           .
                  White, AIAN, Asian, PI |          .           .           .
 White, AIAN, Asian, other race write_in |          .           .           .
    White, AIAN, PI, other race write_in |          .           .           .
   White, Asian, PI, other race write_in |          .           .           .
White, Chinese, Japanese, Native Hawaiia |          .           .           .
                  Black, AIAN, Asian, PI |          .           .           .
 Black, AIAN, Asian, other race write_in |          .           .           .
    Black, AIAN, PI, other race write_in |          .           .           .
   Black, Asian, PI, other race write_in |          .           .           .
    AIAN, Asian, PI, other race write_in |          .           .           .
Two specified Asian  (Chinese and other  |          .           .           .
           White, Black, AIAN, Asian, PI |          .           .           .
White, Black, AIAN, Asian, other race wr |          .           .           .
White, Black, AIAN, PI, other race write |          .           .           .
White, Black, Asian, PI, other race writ |          .           .           .
White, AIAN, Asian, PI, other race write |          .           .           .
Black, AIAN, Asian, PI, other race write |          .           .           .
White, Black, AIAN, Asian, PI, other rac |          .           .           .
White race; Some other race; Black or Af |          .           .           .
-----------------------------------------------------------------------------

-----------------------------------------------------------------------------
                                         |             raceshort             
                 Race [detailed version] |      Asian      Latino    Multiple
-----------------------------------------+-----------------------------------
                                   White |          .     2790401     171,715
                             Black/Negro |          .      81,137      18,919
                                  Apache |          .       1,464         733
                               Blackfoot |          .         191          78
                                Cherokee |          .       1,299         578
                                Cheyenne |          .          82          32
                               Chickasaw |          .          54          32
                                Chippewa |          .         386         160
                                 Choctaw |          .         281         154
                                Comanche |          .         179          74
                                   Creek |          .         113          65
                                    Crow |          .          21          17
                                Iroquois |          .         141         119
                                   Kiowa |          .          18          10
                                  Lumbee |          .          53          28
                                  Navajo |          .       1,069         672
                                   Osage |          .          10           1
                                  Paiute |          .         112          46
                                    Pima |          .         195          85
                              Potawatomi |          .          85          40
                                  Pueblo |          .         646         291
                                Seminole |          .          86          44
                                Shoshone |          .          38          32
                                   Sioux |          .         537         282
       Tlingit (Tlingit_Haida, 2000/ACS) |          .          42          24
                          Tohono O Odham |          .         286         154
                 All other tribes (1990) |          .       1,330         911
                                    Hopi |          .           5           4
                                Delaware |          .           6           7
                   Latin American Indian |          .       4,428         553
                      Puget Sound Salish |          .         119          41
                                  Yakama |          .          23           3
                                   Yaqui |          .         903         376
                                Colville |          .           9           3
                                   Houma |          .           2           2
                               Menominee |          .          14           8
                                   Yuman |          .          70          29
                   South American Indian |          .         116          14
                 Mexican American Indian |          .         761          16
     Other Amer. Indian tribe (2000,ACS) |          .      10,028       1,715
       2+ Amer. Indian tribes (2000,ACS) |          .         854         377
                      Alaskan Athabaskan |          .          18          29
                                   Aleut |          .          89          23
                                  Eskimo |          .         114          72
                                 Inupiat |          .           6           2
                                  Yup'ik |          .           1           3
 Other Alaska Native tribe(s) (2000,ACS) |          .          47          16
Both Am. Ind. and Alaska Native (2000,AC |          .       1,255         229
                     Tribe not specified |          .      15,727       1,489
                                 Chinese |    446,617       1,690       1,127
                               Taiwanese |     11,768           8           5
                   Chinese and Taiwanese |        632           1           .
                                Japanese |    155,194         953       1,244
                                Filipino |    349,087       5,730       3,728
          Asian Indian (Hindu 1920_1940) |    312,854       1,520         229
                                  Korean |    191,890         519         500
                                Hawaiian |          .       2,257          25
                              Vietnamese |    191,039       1,519         243
                               Bhutanese |        124           .           .
                              Mongolian  |        136           7           .
                                Nepalese |        659           1           1
                               Cambodian |     31,198         126          66
                                   Hmong |     24,704          54           6
                                 Laotian |     28,217         228          73
                                    Thai |     22,094          68          99
                             Bangladeshi |      8,647          15           4
                                 Burmese |      1,219           4           .
                              Indonesian |      7,885          79          19
                               Malaysian |      2,053           4           6
                                Okinawan |        116           .           4
                               Pakistani |     30,954          70          56
                              Sri Lankan |      4,264          13           4
                     Other Asian, n.e.c. |     10,446         666          46
                    Asian, not specified |     17,531         407          37
                    Chinese and Japanese |      4,218          44          11
                    Chinese and Filipino |      4,102         235          66
                  Chinese and Vietnamese |      5,536          23           9
              Chinese and Asian write_in |      2,554          15          13
                   Japanese and Filipino |      2,511         100          43
         Asian Indian and Asian write_in |      2,491          10           9
           Other Asian race combinations |     15,231         208          84
                                  Samoan |          .         347         111
                                Tahitian |          .           .           .
                                  Tongan |          .          35          26
                 Other Polynesian (1990) |          .           2           1
    1+ other Polynesian races (2000,ACS) |          .          37          16
                      Guamanian/Chamorro |          .       1,499         281
               Northern Mariana Islander |          .           .           .
                                 Palauan |          .           3           .
                Other Micronesian (1990) |          .           6           1
   1+ other Micronesian races (2000,ACS) |          .          15           7
                                  Fijian |          .           5           1
                 Other Melanesian (1990) |          .           .           .
    1+ other Melanesian races (2000,ACS) |          .           8           3
          2+ PI races from 2+ PI regions |          .          22           5
                  Pacific Islander, n.s. |          .         429          26
                      Other race, n.e.c. |          .     2010246           .
                         White and Black |          .      14,514     141,221
                          White and AIAN |          .      13,804     199,143
                       White and Chinese |          .         583      19,937
                      White and Japanese |          .         626      29,275
                      White and Filipino |          .       1,591      37,152
                  White and Asian Indian |          .         322       9,737
                        White and Korean |          .         211      15,837
                    White and Vietnamese |          .         105       6,638
                White and Asian write_in |          .         267      16,848
           White and other Asian race(s) |          .         256       7,939
      White and two or more Asian groups |          .         219       3,614
               White and Native Hawaiian |          .         511       9,141
                        White and Samoan |          .          81       1,880
                     White and Guamanian |          .         174       1,857
                   White and PI write_in |          .         166       2,307
              White and other PI race(s) |          .          44         932
           White and other race write_in |          .     103,638      72,697
            White and other race, n.e.c. |          .           .           3
                          Black and AIAN |          .       1,275      27,656
                       Black and Chinese |          .          81       1,601
                      Black and Japanese |          .          51       1,787
                      Black and Filipino |          .         145       4,122
                  Black and Asian Indian |          .         117       2,331
                        Black and Korean |          .          46       1,660
                Black and Asian write_in |          .          71       1,955
           Black and other Asian race(s) |          .          51       1,233
                   Black and PI write_in |          .         156       2,146
              Black and other PI race(s) |          .          37         762
           Black and other race write_in |          .      10,089      24,053
             AIAN and Filipino (2000 1%) |          .          14          83
                   AIAN and Asian Indian |          .          90         608
            AIAN and other Asian race(s) |          .         482       3,839
                             AIAN and PI |          .         127         672
            AIAN and other race write_in |          .       7,937       1,775
                    Chinese and Hawaiian |          .         147       2,891
   Chinese, Filipino, Hawaiian (2000 1%) |          .          68         610
         Japanese and Hawaiian (2000 1%) |          .          36         854
                   Filipino and Hawaiian |          .         212       2,607
                Filipino and PI write_in |          .          26       1,139
          Asian write_in and PI write_in |          .         205       4,669
      Other Asian race(s) and PI race(s) |          .         291       4,895
               Japanese and Korean (ACS) |          .           .           1
         Chinese and other race write_in |          .         267       1,327
        Japanese and other race write_in |          .         120         496
        Filipino and other race write_in |          .         605       3,997
    Asian Indian and other race write_in |          .         284       3,982
  Asian write_in and other race write_in |          .       1,725       4,011
Other Asian race(s) and other race write |          .         513       5,728
                      Chinese and Korean |          .           2         156
            PI and other race write_in:  |          .         135          75
     PI write_in and other race write_in |          .         729         261
Other PI race(s) and other race write_in |          .         689       1,093
         Native Hawaiian or PI other rac |          .          21          96
                      White, Black, AIAN |          .       2,278      17,470
                     White, Black, Asian |          .         361       3,805
                        White, Black, PI |          .          47         528
       White, Black, other race write_in |          .       1,999       2,778
                      White, AIAN, Asian |          .         552       3,383
                         White, AIAN, PI |          .          98         679
        White, AIAN, other race write_in |          .       1,410       2,210
                White, Chinese, Hawaiian |          .         277       3,711
White, Chinese, Filipino, Hawaiian (2000 |          .         166         866
     White, Japanese, Hawaiian (2000 1%) |          .          52         878
               White, Filipino, Hawaiian |          .         204       1,830
  Other White, Asian race(s), PI race(s) |          .         734       6,596
                White, AIAN and Filipino |          .          15         115
              White, Black, and Filipino |          .          30         145
       White, Asian, other race write_in |          .         431       1,743
White, Filipino, other race write_in (20 |          .          13         110
White, Asian write_in, other race write_ |          .           4          91
Other White, Asian race(s), other race w |          .         456       1,208
          White, PI, other race write_in |          .         264         822
                      Black, AIAN, Asian |          .          60         626
                         Black, AIAN, PI |          .          33         102
        Black, AIAN, other race write_in |          .         159         575
                        Black, Asian, PI |          .          85         440
       Black, Asian, other race write_in |          .         135         556
          Black, PI, other race write_in |          .          43          77
                         AIAN, Asian, PI |          .         107         243
        AIAN, Asian, other race write_in |          .          98         115
           AIAN, PI, other race write_in |          .          24          16
          Asian, PI, other race write_in |          .         174         485
Asian (Chinese, Japanese, Korean, Vietna |          .           7         184
               White, Black, AIAN, Asian |          .         228       1,198
                  White, Black, AIAN, PI |          .          24         149
 White, Black, AIAN, other race write_in |          .         210         334
                 White, Black, Asian, PI |          .          55         249
White, Black, Asian, other race write_in |          .          55         125
   White, Black, PI, other race write_in |          .          16          21
                  White, AIAN, Asian, PI |          .         238         956
 White, AIAN, Asian, other race write_in |          .          48         104
    White, AIAN, PI, other race write_in |          .          11          32
   White, Asian, PI, other race write_in |          .         339       1,548
White, Chinese, Japanese, Native Hawaiia |          .           3          93
                  Black, AIAN, Asian, PI |          .          23          58
 Black, AIAN, Asian, other race write_in |          .          12          20
    Black, AIAN, PI, other race write_in |          .           6          10
   Black, Asian, PI, other race write_in |          .          45         154
    AIAN, Asian, PI, other race write_in |          .          36         213
Two specified Asian  (Chinese and other  |          .          64         470
           White, Black, AIAN, Asian, PI |          .          59         159
White, Black, AIAN, Asian, other race wr |          .          28          39
White, Black, AIAN, PI, other race write |          .          36          49
White, Black, Asian, PI, other race writ |          .          23         134
White, AIAN, Asian, PI, other race write |          .          25          27
Black, AIAN, Asian, PI, other race write |          .          53         145
White, Black, AIAN, Asian, PI, other rac |          .          80         285
White race; Some other race; Black or Af |          .           .           2
-----------------------------------------------------------------------------

-----------------------------------------------------
                                         | raceshort 
                 Race [detailed version] |      Other
-----------------------------------------+-----------
                                   White |          .
                             Black/Negro |          .
                                  Apache |          .
                               Blackfoot |          .
                                Cherokee |          .
                                Cheyenne |          .
                               Chickasaw |          .
                                Chippewa |          .
                                 Choctaw |          .
                                Comanche |          .
                                   Creek |          .
                                    Crow |          .
                                Iroquois |          .
                                   Kiowa |          .
                                  Lumbee |          .
                                  Navajo |          .
                                   Osage |          .
                                  Paiute |          .
                                    Pima |          .
                              Potawatomi |          .
                                  Pueblo |          .
                                Seminole |          .
                                Shoshone |          .
                                   Sioux |          .
       Tlingit (Tlingit_Haida, 2000/ACS) |          .
                          Tohono O Odham |          .
                 All other tribes (1990) |          .
                                    Hopi |          .
                                Delaware |          .
                   Latin American Indian |          .
                      Puget Sound Salish |          .
                                  Yakama |          .
                                   Yaqui |          .
                                Colville |          .
                                   Houma |          .
                               Menominee |          .
                                   Yuman |          .
                   South American Indian |          .
                 Mexican American Indian |          .
     Other Amer. Indian tribe (2000,ACS) |          .
       2+ Amer. Indian tribes (2000,ACS) |          .
                      Alaskan Athabaskan |          .
                                   Aleut |          .
                                  Eskimo |          .
                                 Inupiat |          .
                                  Yup'ik |          .
 Other Alaska Native tribe(s) (2000,ACS) |          .
Both Am. Ind. and Alaska Native (2000,AC |          .
                     Tribe not specified |          .
                                 Chinese |          .
                               Taiwanese |          .
                   Chinese and Taiwanese |          .
                                Japanese |          .
                                Filipino |          .
          Asian Indian (Hindu 1920_1940) |          .
                                  Korean |          .
                                Hawaiian |          .
                              Vietnamese |          .
                               Bhutanese |          .
                              Mongolian  |          .
                                Nepalese |          .
                               Cambodian |          .
                                   Hmong |          .
                                 Laotian |          .
                                    Thai |          .
                             Bangladeshi |          .
                                 Burmese |          .
                              Indonesian |          .
                               Malaysian |          .
                                Okinawan |          .
                               Pakistani |          .
                              Sri Lankan |          .
                     Other Asian, n.e.c. |          .
                    Asian, not specified |          .
                    Chinese and Japanese |          .
                    Chinese and Filipino |          .
                  Chinese and Vietnamese |          .
              Chinese and Asian write_in |          .
                   Japanese and Filipino |          .
         Asian Indian and Asian write_in |          .
           Other Asian race combinations |          .
                                  Samoan |          .
                                Tahitian |          .
                                  Tongan |          .
                 Other Polynesian (1990) |          .
    1+ other Polynesian races (2000,ACS) |          .
                      Guamanian/Chamorro |          .
               Northern Mariana Islander |          .
                                 Palauan |          .
                Other Micronesian (1990) |          .
   1+ other Micronesian races (2000,ACS) |          .
                                  Fijian |          .
                 Other Melanesian (1990) |          .
    1+ other Melanesian races (2000,ACS) |          .
          2+ PI races from 2+ PI regions |          .
                  Pacific Islander, n.s. |          .
                      Other race, n.e.c. |     73,890
                         White and Black |          .
                          White and AIAN |          .
                       White and Chinese |          .
                      White and Japanese |          .
                      White and Filipino |          .
                  White and Asian Indian |          .
                        White and Korean |          .
                    White and Vietnamese |          .
                White and Asian write_in |          .
           White and other Asian race(s) |          .
      White and two or more Asian groups |          .
               White and Native Hawaiian |          .
                        White and Samoan |          .
                     White and Guamanian |          .
                   White and PI write_in |          .
              White and other PI race(s) |          .
           White and other race write_in |          .
            White and other race, n.e.c. |          .
                          Black and AIAN |          .
                       Black and Chinese |          .
                      Black and Japanese |          .
                      Black and Filipino |          .
                  Black and Asian Indian |          .
                        Black and Korean |          .
                Black and Asian write_in |          .
           Black and other Asian race(s) |          .
                   Black and PI write_in |          .
              Black and other PI race(s) |          .
           Black and other race write_in |          .
             AIAN and Filipino (2000 1%) |          .
                   AIAN and Asian Indian |          .
            AIAN and other Asian race(s) |          .
                             AIAN and PI |          .
            AIAN and other race write_in |          .
                    Chinese and Hawaiian |          .
   Chinese, Filipino, Hawaiian (2000 1%) |          .
         Japanese and Hawaiian (2000 1%) |          .
                   Filipino and Hawaiian |          .
                Filipino and PI write_in |          .
          Asian write_in and PI write_in |          .
      Other Asian race(s) and PI race(s) |          .
               Japanese and Korean (ACS) |          .
         Chinese and other race write_in |          .
        Japanese and other race write_in |          .
        Filipino and other race write_in |          .
    Asian Indian and other race write_in |          .
  Asian write_in and other race write_in |          .
Other Asian race(s) and other race write |          .
                      Chinese and Korean |          .
            PI and other race write_in:  |          .
     PI write_in and other race write_in |          .
Other PI race(s) and other race write_in |          .
         Native Hawaiian or PI other rac |          .
                      White, Black, AIAN |          .
                     White, Black, Asian |          .
                        White, Black, PI |          .
       White, Black, other race write_in |          .
                      White, AIAN, Asian |          .
                         White, AIAN, PI |          .
        White, AIAN, other race write_in |          .
                White, Chinese, Hawaiian |          .
White, Chinese, Filipino, Hawaiian (2000 |          .
     White, Japanese, Hawaiian (2000 1%) |          .
               White, Filipino, Hawaiian |          .
  Other White, Asian race(s), PI race(s) |          .
                White, AIAN and Filipino |          .
              White, Black, and Filipino |          .
       White, Asian, other race write_in |          .
White, Filipino, other race write_in (20 |          .
White, Asian write_in, other race write_ |          .
Other White, Asian race(s), other race w |          .
          White, PI, other race write_in |          .
                      Black, AIAN, Asian |          .
                         Black, AIAN, PI |          .
        Black, AIAN, other race write_in |          .
                        Black, Asian, PI |          .
       Black, Asian, other race write_in |          .
          Black, PI, other race write_in |          .
                         AIAN, Asian, PI |          .
        AIAN, Asian, other race write_in |          .
           AIAN, PI, other race write_in |          .
          Asian, PI, other race write_in |          .
Asian (Chinese, Japanese, Korean, Vietna |          .
               White, Black, AIAN, Asian |          .
                  White, Black, AIAN, PI |          .
 White, Black, AIAN, other race write_in |          .
                 White, Black, Asian, PI |          .
White, Black, Asian, other race write_in |          .
   White, Black, PI, other race write_in |          .
                  White, AIAN, Asian, PI |          .
 White, AIAN, Asian, other race write_in |          .
    White, AIAN, PI, other race write_in |          .
   White, Asian, PI, other race write_in |          .
White, Chinese, Japanese, Native Hawaiia |          .
                  Black, AIAN, Asian, PI |          .
 Black, AIAN, Asian, other race write_in |          .
    Black, AIAN, PI, other race write_in |          .
   Black, Asian, PI, other race write_in |          .
    AIAN, Asian, PI, other race write_in |          .
Two specified Asian  (Chinese and other  |          .
           White, Black, AIAN, Asian, PI |          .
White, Black, AIAN, Asian, other race wr |          .
White, Black, AIAN, PI, other race write |          .
White, Black, Asian, PI, other race writ |          .
White, AIAN, Asian, PI, other race write |          .
Black, AIAN, Asian, PI, other race write |          .
White, Black, AIAN, Asian, PI, other rac |          .
White race; Some other race; Black or Af |          .
-----------------------------------------------------

. table raced raceombd, missing

---------------------------------------------------------------------
                                         |          raceombd         
                 Race [detailed version] |        White         Black
-----------------------------------------+---------------------------
                                   White |     3.83e+07             .
                             Black/Negro |            .       5300690
                                  Apache |            .             .
                               Blackfoot |            .             .
                                Cherokee |            .             .
                                Cheyenne |            .             .
                               Chickasaw |            .             .
                                Chippewa |            .             .
                                 Choctaw |            .             .
                                Comanche |            .             .
                                   Creek |            .             .
                                    Crow |            .             .
                                Iroquois |            .             .
                                   Kiowa |            .             .
                                  Lumbee |            .             .
                                  Navajo |            .             .
                                   Osage |            .             .
                                  Paiute |            .             .
                                    Pima |            .             .
                              Potawatomi |            .             .
                                  Pueblo |            .             .
                                Seminole |            .             .
                                Shoshone |            .             .
                                   Sioux |            .             .
       Tlingit (Tlingit_Haida, 2000/ACS) |            .             .
                          Tohono O Odham |            .             .
                 All other tribes (1990) |            .             .
                                    Hopi |            .             .
                                Delaware |            .             .
                   Latin American Indian |            .             .
                      Puget Sound Salish |            .             .
                                  Yakama |            .             .
                                   Yaqui |            .             .
                                Colville |            .             .
                                   Houma |            .             .
                               Menominee |            .             .
                                   Yuman |            .             .
                   South American Indian |            .             .
                 Mexican American Indian |            .             .
     Other Amer. Indian tribe (2000,ACS) |            .             .
       2+ Amer. Indian tribes (2000,ACS) |            .             .
                      Alaskan Athabaskan |            .             .
                                   Aleut |            .             .
                                  Eskimo |            .             .
                                 Inupiat |            .             .
                                  Yup'ik |            .             .
 Other Alaska Native tribe(s) (2000,ACS) |            .             .
Both Am. Ind. and Alaska Native (2000,AC |            .             .
                     Tribe not specified |            .             .
                                 Chinese |            .             .
                               Taiwanese |            .             .
                   Chinese and Taiwanese |            .             .
                                Japanese |            .             .
                                Filipino |            .             .
          Asian Indian (Hindu 1920_1940) |            .             .
                                  Korean |            .             .
                                Hawaiian |            .             .
                              Vietnamese |            .             .
                               Bhutanese |            .             .
                              Mongolian  |            .             .
                                Nepalese |            .             .
                               Cambodian |            .             .
                                   Hmong |            .             .
                                 Laotian |            .             .
                                    Thai |            .             .
                             Bangladeshi |            .             .
                                 Burmese |            .             .
                              Indonesian |            .             .
                               Malaysian |            .             .
                                Okinawan |            .             .
                               Pakistani |            .             .
                              Sri Lankan |            .             .
                     Other Asian, n.e.c. |            .             .
                    Asian, not specified |            .             .
                    Chinese and Japanese |            .             .
                    Chinese and Filipino |            .             .
                  Chinese and Vietnamese |            .             .
              Chinese and Asian write_in |            .             .
                   Japanese and Filipino |            .             .
         Asian Indian and Asian write_in |            .             .
           Other Asian race combinations |            .             .
                                  Samoan |            .             .
                                Tahitian |            .             .
                                  Tongan |            .             .
                 Other Polynesian (1990) |            .             .
    1+ other Polynesian races (2000,ACS) |            .             .
                      Guamanian/Chamorro |            .             .
               Northern Mariana Islander |            .             .
                                 Palauan |            .             .
                Other Micronesian (1990) |            .             .
   1+ other Micronesian races (2000,ACS) |            .             .
                                  Fijian |            .             .
                 Other Melanesian (1990) |            .             .
    1+ other Melanesian races (2000,ACS) |            .             .
          2+ PI races from 2+ PI regions |            .             .
                  Pacific Islander, n.s. |            .             .
                      Other race, n.e.c. |            .             .
                         White and Black |            .             .
                          White and AIAN |            .             .
                       White and Chinese |            .             .
                      White and Japanese |            .             .
                      White and Filipino |            .             .
                  White and Asian Indian |            .             .
                        White and Korean |            .             .
                    White and Vietnamese |            .             .
                White and Asian write_in |            .             .
           White and other Asian race(s) |            .             .
      White and two or more Asian groups |            .             .
               White and Native Hawaiian |            .             .
                        White and Samoan |            .             .
                     White and Guamanian |            .             .
                   White and PI write_in |            .             .
              White and other PI race(s) |            .             .
           White and other race write_in |            .             .
            White and other race, n.e.c. |            .             .
                          Black and AIAN |            .             .
                       Black and Chinese |            .             .
                      Black and Japanese |            .             .
                      Black and Filipino |            .             .
                  Black and Asian Indian |            .             .
                        Black and Korean |            .             .
                Black and Asian write_in |            .             .
           Black and other Asian race(s) |            .             .
                   Black and PI write_in |            .             .
              Black and other PI race(s) |            .             .
           Black and other race write_in |            .             .
             AIAN and Filipino (2000 1%) |            .             .
                   AIAN and Asian Indian |            .             .
            AIAN and other Asian race(s) |            .             .
                             AIAN and PI |            .             .
            AIAN and other race write_in |            .             .
                    Chinese and Hawaiian |            .             .
   Chinese, Filipino, Hawaiian (2000 1%) |            .             .
         Japanese and Hawaiian (2000 1%) |            .             .
                   Filipino and Hawaiian |            .             .
                Filipino and PI write_in |            .             .
          Asian write_in and PI write_in |            .             .
      Other Asian race(s) and PI race(s) |            .             .
               Japanese and Korean (ACS) |            .             .
         Chinese and other race write_in |            .             .
        Japanese and other race write_in |            .             .
        Filipino and other race write_in |            .             .
    Asian Indian and other race write_in |            .             .
  Asian write_in and other race write_in |            .             .
Other Asian race(s) and other race write |            .             .
                      Chinese and Korean |            .             .
            PI and other race write_in:  |            .             .
     PI write_in and other race write_in |            .             .
Other PI race(s) and other race write_in |            .             .
         Native Hawaiian or PI other rac |            .             .
                      White, Black, AIAN |            .             .
                     White, Black, Asian |            .             .
                        White, Black, PI |            .             .
       White, Black, other race write_in |            .             .
                      White, AIAN, Asian |            .             .
                         White, AIAN, PI |            .             .
        White, AIAN, other race write_in |            .             .
                White, Chinese, Hawaiian |            .             .
White, Chinese, Filipino, Hawaiian (2000 |            .             .
     White, Japanese, Hawaiian (2000 1%) |            .             .
               White, Filipino, Hawaiian |            .             .
  Other White, Asian race(s), PI race(s) |            .             .
                White, AIAN and Filipino |            .             .
              White, Black, and Filipino |            .             .
       White, Asian, other race write_in |            .             .
White, Filipino, other race write_in (20 |            .             .
White, Asian write_in, other race write_ |            .             .
Other White, Asian race(s), other race w |            .             .
          White, PI, other race write_in |            .             .
                      Black, AIAN, Asian |            .             .
                         Black, AIAN, PI |            .             .
        Black, AIAN, other race write_in |            .             .
                        Black, Asian, PI |            .             .
       Black, Asian, other race write_in |            .             .
          Black, PI, other race write_in |            .             .
                         AIAN, Asian, PI |            .             .
        AIAN, Asian, other race write_in |            .             .
           AIAN, PI, other race write_in |            .             .
          Asian, PI, other race write_in |            .             .
Asian (Chinese, Japanese, Korean, Vietna |            .             .
               White, Black, AIAN, Asian |            .             .
                  White, Black, AIAN, PI |            .             .
 White, Black, AIAN, other race write_in |            .             .
                 White, Black, Asian, PI |            .             .
White, Black, Asian, other race write_in |            .             .
   White, Black, PI, other race write_in |            .             .
                  White, AIAN, Asian, PI |            .             .
 White, AIAN, Asian, other race write_in |            .             .
    White, AIAN, PI, other race write_in |            .             .
   White, Asian, PI, other race write_in |            .             .
White, Chinese, Japanese, Native Hawaiia |            .             .
                  Black, AIAN, Asian, PI |            .             .
 Black, AIAN, Asian, other race write_in |            .             .
    Black, AIAN, PI, other race write_in |            .             .
   Black, Asian, PI, other race write_in |            .             .
    AIAN, Asian, PI, other race write_in |            .             .
Two specified Asian  (Chinese and other  |            .             .
           White, Black, AIAN, Asian, PI |            .             .
White, Black, AIAN, Asian, other race wr |            .             .
White, Black, AIAN, PI, other race write |            .             .
White, Black, Asian, PI, other race writ |            .             .
White, AIAN, Asian, PI, other race write |            .             .
Black, AIAN, Asian, PI, other race write |            .             .
White, Black, AIAN, Asian, PI, other rac |            .             .
White race; Some other race; Black or Af |            .             .
---------------------------------------------------------------------

---------------------------------------------------------------------
                                         |          raceombd         
                 Race [detailed version] |        Indig         Asian
-----------------------------------------+---------------------------
                                   White |            .             .
                             Black/Negro |            .             .
                                  Apache |       10,094             .
                               Blackfoot |        6,996             .
                                Cherokee |       60,359             .
                                Cheyenne |        2,193             .
                               Chickasaw |        4,252             .
                                Chippewa |       22,969             .
                                 Choctaw |       17,599             .
                                Comanche |        1,995             .
                                   Creek |        8,438             .
                                    Crow |        1,208             .
                                Iroquois |        9,876             .
                                   Kiowa |          489             .
                                  Lumbee |       10,221             .
                                  Navajo |       56,428             .
                                   Osage |          473             .
                                  Paiute |        2,092             .
                                    Pima |        2,319             .
                              Potawatomi |        3,597             .
                                  Pueblo |       14,200             .
                                Seminole |        2,838             .
                                Shoshone |          551             .
                                   Sioux |       22,314             .
       Tlingit (Tlingit_Haida, 2000/ACS) |        3,609             .
                          Tohono O Odham |        3,338             .
                 All other tribes (1990) |       19,222             .
                                    Hopi |          190             .
                                Delaware |          573             .
                   Latin American Indian |          413             .
                      Puget Sound Salish |        2,753             .
                                  Yakama |          566             .
                                   Yaqui |        1,739             .
                                Colville |          673             .
                                   Houma |          469             .
                               Menominee |          533             .
                                   Yuman |          906             .
                   South American Indian |            3             .
                 Mexican American Indian |           49             .
     Other Amer. Indian tribe (2000,ACS) |       55,366             .
       2+ Amer. Indian tribes (2000,ACS) |       11,491             .
                      Alaskan Athabaskan |        4,331             .
                                   Aleut |        3,762             .
                                  Eskimo |       17,213             .
                                 Inupiat |          669             .
                                  Yup'ik |          965             .
 Other Alaska Native tribe(s) (2000,ACS) |        2,167             .
Both Am. Ind. and Alaska Native (2000,AC |        5,687             .
                     Tribe not specified |       43,539             .
                                 Chinese |            .       446,617
                               Taiwanese |            .        11,768
                   Chinese and Taiwanese |            .           632
                                Japanese |            .       155,194
                                Filipino |            .       349,087
          Asian Indian (Hindu 1920_1940) |            .       312,854
                                  Korean |            .       191,890
                                Hawaiian |       28,999             .
                              Vietnamese |            .       191,039
                               Bhutanese |            .           124
                              Mongolian  |            .           136
                                Nepalese |            .           659
                               Cambodian |            .        31,198
                                   Hmong |            .        24,704
                                 Laotian |            .        28,217
                                    Thai |            .        22,094
                             Bangladeshi |            .         8,647
                                 Burmese |            .         1,219
                              Indonesian |            .         7,885
                               Malaysian |            .         2,053
                                Okinawan |            .           116
                               Pakistani |            .        30,954
                              Sri Lankan |            .         4,264
                     Other Asian, n.e.c. |            .        10,446
                    Asian, not specified |            .        17,531
                    Chinese and Japanese |            .         4,218
                    Chinese and Filipino |            .         4,102
                  Chinese and Vietnamese |            .         5,536
              Chinese and Asian write_in |            .         2,554
                   Japanese and Filipino |            .         2,511
         Asian Indian and Asian write_in |            .         2,491
           Other Asian race combinations |            .        15,231
                                  Samoan |       11,393             .
                                Tahitian |           36             .
                                  Tongan |        4,402             .
                 Other Polynesian (1990) |          130             .
    1+ other Polynesian races (2000,ACS) |        1,378             .
                      Guamanian/Chamorro |        8,010             .
               Northern Mariana Islander |           37             .
                                 Palauan |           61             .
                Other Micronesian (1990) |          268             .
   1+ other Micronesian races (2000,ACS) |        2,152             .
                                  Fijian |          654             .
                 Other Melanesian (1990) |            2             .
    1+ other Melanesian races (2000,ACS) |        2,088             .
          2+ PI races from 2+ PI regions |          305             .
                  Pacific Islander, n.s. |        2,658             .
                      Other race, n.e.c. |            .             .
                         White and Black |            .             .
                          White and AIAN |            .             .
                       White and Chinese |            .             .
                      White and Japanese |            .             .
                      White and Filipino |            .             .
                  White and Asian Indian |            .             .
                        White and Korean |            .             .
                    White and Vietnamese |            .             .
                White and Asian write_in |            .             .
           White and other Asian race(s) |            .             .
      White and two or more Asian groups |            .             .
               White and Native Hawaiian |            .             .
                        White and Samoan |            .             .
                     White and Guamanian |            .             .
                   White and PI write_in |            .             .
              White and other PI race(s) |            .             .
           White and other race write_in |            .             .
            White and other race, n.e.c. |            .             .
                          Black and AIAN |            .             .
                       Black and Chinese |            .             .
                      Black and Japanese |            .             .
                      Black and Filipino |            .             .
                  Black and Asian Indian |            .             .
                        Black and Korean |            .             .
                Black and Asian write_in |            .             .
           Black and other Asian race(s) |            .             .
                   Black and PI write_in |            .             .
              Black and other PI race(s) |            .             .
           Black and other race write_in |            .             .
             AIAN and Filipino (2000 1%) |            .             .
                   AIAN and Asian Indian |            .             .
            AIAN and other Asian race(s) |            .             .
                             AIAN and PI |            .             .
            AIAN and other race write_in |            .             .
                    Chinese and Hawaiian |            .             .
   Chinese, Filipino, Hawaiian (2000 1%) |            .             .
         Japanese and Hawaiian (2000 1%) |            .             .
                   Filipino and Hawaiian |            .             .
                Filipino and PI write_in |            .             .
          Asian write_in and PI write_in |            .             .
      Other Asian race(s) and PI race(s) |            .             .
               Japanese and Korean (ACS) |            .             .
         Chinese and other race write_in |            .             .
        Japanese and other race write_in |            .             .
        Filipino and other race write_in |            .             .
    Asian Indian and other race write_in |            .             .
  Asian write_in and other race write_in |            .             .
Other Asian race(s) and other race write |            .             .
                      Chinese and Korean |            .             .
            PI and other race write_in:  |            .             .
     PI write_in and other race write_in |            .             .
Other PI race(s) and other race write_in |            .             .
         Native Hawaiian or PI other rac |            .             .
                      White, Black, AIAN |            .             .
                     White, Black, Asian |            .             .
                        White, Black, PI |            .             .
       White, Black, other race write_in |            .             .
                      White, AIAN, Asian |            .             .
                         White, AIAN, PI |            .             .
        White, AIAN, other race write_in |            .             .
                White, Chinese, Hawaiian |            .             .
White, Chinese, Filipino, Hawaiian (2000 |            .             .
     White, Japanese, Hawaiian (2000 1%) |            .             .
               White, Filipino, Hawaiian |            .             .
  Other White, Asian race(s), PI race(s) |            .             .
                White, AIAN and Filipino |            .             .
              White, Black, and Filipino |            .             .
       White, Asian, other race write_in |            .             .
White, Filipino, other race write_in (20 |            .             .
White, Asian write_in, other race write_ |            .             .
Other White, Asian race(s), other race w |            .             .
          White, PI, other race write_in |            .             .
                      Black, AIAN, Asian |            .             .
                         Black, AIAN, PI |            .             .
        Black, AIAN, other race write_in |            .             .
                        Black, Asian, PI |            .             .
       Black, Asian, other race write_in |            .             .
          Black, PI, other race write_in |            .             .
                         AIAN, Asian, PI |            .             .
        AIAN, Asian, other race write_in |            .             .
           AIAN, PI, other race write_in |            .             .
          Asian, PI, other race write_in |            .             .
Asian (Chinese, Japanese, Korean, Vietna |            .             .
               White, Black, AIAN, Asian |            .             .
                  White, Black, AIAN, PI |            .             .
 White, Black, AIAN, other race write_in |            .             .
                 White, Black, Asian, PI |            .             .
White, Black, Asian, other race write_in |            .             .
   White, Black, PI, other race write_in |            .             .
                  White, AIAN, Asian, PI |            .             .
 White, AIAN, Asian, other race write_in |            .             .
    White, AIAN, PI, other race write_in |            .             .
   White, Asian, PI, other race write_in |            .             .
White, Chinese, Japanese, Native Hawaiia |            .             .
                  Black, AIAN, Asian, PI |            .             .
 Black, AIAN, Asian, other race write_in |            .             .
    Black, AIAN, PI, other race write_in |            .             .
   Black, Asian, PI, other race write_in |            .             .
    AIAN, Asian, PI, other race write_in |            .             .
Two specified Asian  (Chinese and other  |            .             .
           White, Black, AIAN, Asian, PI |            .             .
White, Black, AIAN, Asian, other race wr |            .             .
White, Black, AIAN, PI, other race write |            .             .
White, Black, Asian, PI, other race writ |            .             .
White, AIAN, Asian, PI, other race write |            .             .
Black, AIAN, Asian, PI, other race write |            .             .
White, Black, AIAN, Asian, PI, other rac |            .             .
White race; Some other race; Black or Af |            .             .
---------------------------------------------------------------------

---------------------------------------------------------------------
                                         |          raceombd         
                 Race [detailed version] |       Latino   White/Black
-----------------------------------------+---------------------------
                                   White |      2790401             .
                             Black/Negro |       81,137             .
                                  Apache |        1,464             .
                               Blackfoot |          191             .
                                Cherokee |        1,299             .
                                Cheyenne |           82             .
                               Chickasaw |           54             .
                                Chippewa |          386             .
                                 Choctaw |          281             .
                                Comanche |          179             .
                                   Creek |          113             .
                                    Crow |           21             .
                                Iroquois |          141             .
                                   Kiowa |           18             .
                                  Lumbee |           53             .
                                  Navajo |        1,069             .
                                   Osage |           10             .
                                  Paiute |          112             .
                                    Pima |          195             .
                              Potawatomi |           85             .
                                  Pueblo |          646             .
                                Seminole |           86             .
                                Shoshone |           38             .
                                   Sioux |          537             .
       Tlingit (Tlingit_Haida, 2000/ACS) |           42             .
                          Tohono O Odham |          286             .
                 All other tribes (1990) |        1,330             .
                                    Hopi |            5             .
                                Delaware |            6             .
                   Latin American Indian |        4,428             .
                      Puget Sound Salish |          119             .
                                  Yakama |           23             .
                                   Yaqui |          903             .
                                Colville |            9             .
                                   Houma |            2             .
                               Menominee |           14             .
                                   Yuman |           70             .
                   South American Indian |          116             .
                 Mexican American Indian |          761             .
     Other Amer. Indian tribe (2000,ACS) |       10,028             .
       2+ Amer. Indian tribes (2000,ACS) |          854             .
                      Alaskan Athabaskan |           18             .
                                   Aleut |           89             .
                                  Eskimo |          114             .
                                 Inupiat |            6             .
                                  Yup'ik |            1             .
 Other Alaska Native tribe(s) (2000,ACS) |           47             .
Both Am. Ind. and Alaska Native (2000,AC |        1,255             .
                     Tribe not specified |       15,727             .
                                 Chinese |        1,690             .
                               Taiwanese |            8             .
                   Chinese and Taiwanese |            1             .
                                Japanese |          953             .
                                Filipino |        5,730             .
          Asian Indian (Hindu 1920_1940) |        1,520             .
                                  Korean |          519             .
                                Hawaiian |        2,257             .
                              Vietnamese |        1,519             .
                               Bhutanese |            .             .
                              Mongolian  |            7             .
                                Nepalese |            1             .
                               Cambodian |          126             .
                                   Hmong |           54             .
                                 Laotian |          228             .
                                    Thai |           68             .
                             Bangladeshi |           15             .
                                 Burmese |            4             .
                              Indonesian |           79             .
                               Malaysian |            4             .
                                Okinawan |            .             .
                               Pakistani |           70             .
                              Sri Lankan |           13             .
                     Other Asian, n.e.c. |          666             .
                    Asian, not specified |          407             .
                    Chinese and Japanese |           44             .
                    Chinese and Filipino |          235             .
                  Chinese and Vietnamese |           23             .
              Chinese and Asian write_in |           15             .
                   Japanese and Filipino |          100             .
         Asian Indian and Asian write_in |           10             .
           Other Asian race combinations |          208             .
                                  Samoan |          347             .
                                Tahitian |            .             .
                                  Tongan |           35             .
                 Other Polynesian (1990) |            2             .
    1+ other Polynesian races (2000,ACS) |           37             .
                      Guamanian/Chamorro |        1,499             .
               Northern Mariana Islander |            .             .
                                 Palauan |            3             .
                Other Micronesian (1990) |            6             .
   1+ other Micronesian races (2000,ACS) |           15             .
                                  Fijian |            5             .
                 Other Melanesian (1990) |            .             .
    1+ other Melanesian races (2000,ACS) |            8             .
          2+ PI races from 2+ PI regions |           22             .
                  Pacific Islander, n.s. |          429             .
                      Other race, n.e.c. |      2010246             .
                         White and Black |       14,514       135,304
                          White and AIAN |       13,804             .
                       White and Chinese |          583             .
                      White and Japanese |          626             .
                      White and Filipino |        1,591             .
                  White and Asian Indian |          322             .
                        White and Korean |          211             .
                    White and Vietnamese |          105             .
                White and Asian write_in |          267             .
           White and other Asian race(s) |          256             .
      White and two or more Asian groups |          219             .
               White and Native Hawaiian |          511             .
                        White and Samoan |           81             .
                     White and Guamanian |          174             .
                   White and PI write_in |          166             .
              White and other PI race(s) |           44             .
           White and other race write_in |      103,638             .
            White and other race, n.e.c. |            .             .
                          Black and AIAN |        1,275             .
                       Black and Chinese |           81             .
                      Black and Japanese |           51             .
                      Black and Filipino |          145             .
                  Black and Asian Indian |          117             .
                        Black and Korean |           46             .
                Black and Asian write_in |           71             .
           Black and other Asian race(s) |           51             .
                   Black and PI write_in |          156             .
              Black and other PI race(s) |           37             .
           Black and other race write_in |       10,089             .
             AIAN and Filipino (2000 1%) |           14             .
                   AIAN and Asian Indian |           90             .
            AIAN and other Asian race(s) |          482             .
                             AIAN and PI |          127             .
            AIAN and other race write_in |        7,937             .
                    Chinese and Hawaiian |          147             .
   Chinese, Filipino, Hawaiian (2000 1%) |           68             .
         Japanese and Hawaiian (2000 1%) |           36             .
                   Filipino and Hawaiian |          212             .
                Filipino and PI write_in |           26             .
          Asian write_in and PI write_in |          205             .
      Other Asian race(s) and PI race(s) |          291             .
               Japanese and Korean (ACS) |            .             .
         Chinese and other race write_in |          267             .
        Japanese and other race write_in |          120             .
        Filipino and other race write_in |          605             .
    Asian Indian and other race write_in |          284             .
  Asian write_in and other race write_in |        1,725             .
Other Asian race(s) and other race write |          513             .
                      Chinese and Korean |            2             .
            PI and other race write_in:  |          135             .
     PI write_in and other race write_in |          729             .
Other PI race(s) and other race write_in |          689             .
         Native Hawaiian or PI other rac |           21             .
                      White, Black, AIAN |        2,278             .
                     White, Black, Asian |          361             .
                        White, Black, PI |           47             .
       White, Black, other race write_in |        1,999             .
                      White, AIAN, Asian |          552             .
                         White, AIAN, PI |           98             .
        White, AIAN, other race write_in |        1,410             .
                White, Chinese, Hawaiian |          277             .
White, Chinese, Filipino, Hawaiian (2000 |          166             .
     White, Japanese, Hawaiian (2000 1%) |           52             .
               White, Filipino, Hawaiian |          204             .
  Other White, Asian race(s), PI race(s) |          734             .
                White, AIAN and Filipino |           15             .
              White, Black, and Filipino |           30             .
       White, Asian, other race write_in |          431             .
White, Filipino, other race write_in (20 |           13             .
White, Asian write_in, other race write_ |            4             .
Other White, Asian race(s), other race w |          456             .
          White, PI, other race write_in |          264             .
                      Black, AIAN, Asian |           60             .
                         Black, AIAN, PI |           33             .
        Black, AIAN, other race write_in |          159             .
                        Black, Asian, PI |           85             .
       Black, Asian, other race write_in |          135             .
          Black, PI, other race write_in |           43             .
                         AIAN, Asian, PI |          107             .
        AIAN, Asian, other race write_in |           98             .
           AIAN, PI, other race write_in |           24             .
          Asian, PI, other race write_in |          174             .
Asian (Chinese, Japanese, Korean, Vietna |            7             .
               White, Black, AIAN, Asian |          228             .
                  White, Black, AIAN, PI |           24             .
 White, Black, AIAN, other race write_in |          210             .
                 White, Black, Asian, PI |           55             .
White, Black, Asian, other race write_in |           55             .
   White, Black, PI, other race write_in |           16             .
                  White, AIAN, Asian, PI |          238             .
 White, AIAN, Asian, other race write_in |           48             .
    White, AIAN, PI, other race write_in |           11             .
   White, Asian, PI, other race write_in |          339             .
White, Chinese, Japanese, Native Hawaiia |            3             .
                  Black, AIAN, Asian, PI |           23             .
 Black, AIAN, Asian, other race write_in |           12             .
    Black, AIAN, PI, other race write_in |            6             .
   Black, Asian, PI, other race write_in |           45             .
    AIAN, Asian, PI, other race write_in |           36             .
Two specified Asian  (Chinese and other  |           64             .
           White, Black, AIAN, Asian, PI |           59             .
White, Black, AIAN, Asian, other race wr |           28             .
White, Black, AIAN, PI, other race write |           36             .
White, Black, Asian, PI, other race writ |           23             .
White, AIAN, Asian, PI, other race write |           25             .
Black, AIAN, Asian, PI, other race write |           53             .
White, Black, AIAN, Asian, PI, other rac |           80             .
White race; Some other race; Black or Af |            .             .
---------------------------------------------------------------------

---------------------------------------------------------------------
                                         |          raceombd         
                 Race [detailed version] |  White/Indig   White/Asian
-----------------------------------------+---------------------------
                                   White |            .             .
                             Black/Negro |            .             .
                                  Apache |            .             .
                               Blackfoot |            .             .
                                Cherokee |            .             .
                                Cheyenne |            .             .
                               Chickasaw |            .             .
                                Chippewa |            .             .
                                 Choctaw |            .             .
                                Comanche |            .             .
                                   Creek |            .             .
                                    Crow |            .             .
                                Iroquois |            .             .
                                   Kiowa |            .             .
                                  Lumbee |            .             .
                                  Navajo |            .             .
                                   Osage |            .             .
                                  Paiute |            .             .
                                    Pima |            .             .
                              Potawatomi |            .             .
                                  Pueblo |            .             .
                                Seminole |            .             .
                                Shoshone |            .             .
                                   Sioux |            .             .
       Tlingit (Tlingit_Haida, 2000/ACS) |            .             .
                          Tohono O Odham |            .             .
                 All other tribes (1990) |            .             .
                                    Hopi |            .             .
                                Delaware |            .             .
                   Latin American Indian |            .             .
                      Puget Sound Salish |            .             .
                                  Yakama |            .             .
                                   Yaqui |            .             .
                                Colville |            .             .
                                   Houma |            .             .
                               Menominee |            .             .
                                   Yuman |            .             .
                   South American Indian |            .             .
                 Mexican American Indian |            .             .
     Other Amer. Indian tribe (2000,ACS) |            .             .
       2+ Amer. Indian tribes (2000,ACS) |            .             .
                      Alaskan Athabaskan |            .             .
                                   Aleut |            .             .
                                  Eskimo |            .             .
                                 Inupiat |            .             .
                                  Yup'ik |            .             .
 Other Alaska Native tribe(s) (2000,ACS) |            .             .
Both Am. Ind. and Alaska Native (2000,AC |            .             .
                     Tribe not specified |            .             .
                                 Chinese |            .             .
                               Taiwanese |            .             .
                   Chinese and Taiwanese |            .             .
                                Japanese |            .             .
                                Filipino |            .             .
          Asian Indian (Hindu 1920_1940) |            .             .
                                  Korean |            .             .
                                Hawaiian |            .             .
                              Vietnamese |            .             .
                               Bhutanese |            .             .
                              Mongolian  |            .             .
                                Nepalese |            .             .
                               Cambodian |            .             .
                                   Hmong |            .             .
                                 Laotian |            .             .
                                    Thai |            .             .
                             Bangladeshi |            .             .
                                 Burmese |            .             .
                              Indonesian |            .             .
                               Malaysian |            .             .
                                Okinawan |            .             .
                               Pakistani |            .             .
                              Sri Lankan |            .             .
                     Other Asian, n.e.c. |            .             .
                    Asian, not specified |            .             .
                    Chinese and Japanese |            .             .
                    Chinese and Filipino |            .             .
                  Chinese and Vietnamese |            .             .
              Chinese and Asian write_in |            .             .
                   Japanese and Filipino |            .             .
         Asian Indian and Asian write_in |            .             .
           Other Asian race combinations |            .             .
                                  Samoan |            .             .
                                Tahitian |            .             .
                                  Tongan |            .             .
                 Other Polynesian (1990) |            .             .
    1+ other Polynesian races (2000,ACS) |            .             .
                      Guamanian/Chamorro |            .             .
               Northern Mariana Islander |            .             .
                                 Palauan |            .             .
                Other Micronesian (1990) |            .             .
   1+ other Micronesian races (2000,ACS) |            .             .
                                  Fijian |            .             .
                 Other Melanesian (1990) |            .             .
    1+ other Melanesian races (2000,ACS) |            .             .
          2+ PI races from 2+ PI regions |            .             .
                  Pacific Islander, n.s. |            .             .
                      Other race, n.e.c. |            .             .
                         White and Black |            .             .
                          White and AIAN |      192,298             .
                       White and Chinese |            .        19,079
                      White and Japanese |            .        28,224
                      White and Filipino |            .        34,867
                  White and Asian Indian |            .         9,516
                        White and Korean |            .        15,474
                    White and Vietnamese |            .         6,444
                White and Asian write_in |            .        16,529
           White and other Asian race(s) |            .         7,792
      White and two or more Asian groups |            .         3,471
               White and Native Hawaiian |        8,744             .
                        White and Samoan |        1,773             .
                     White and Guamanian |        1,701             .
                   White and PI write_in |        2,246             .
              White and other PI race(s) |          917             .
           White and other race write_in |            .             .
            White and other race, n.e.c. |            .             .
                          Black and AIAN |            .             .
                       Black and Chinese |            .             .
                      Black and Japanese |            .             .
                      Black and Filipino |            .             .
                  Black and Asian Indian |            .             .
                        Black and Korean |            .             .
                Black and Asian write_in |            .             .
           Black and other Asian race(s) |            .             .
                   Black and PI write_in |            .             .
              Black and other PI race(s) |            .             .
           Black and other race write_in |            .             .
             AIAN and Filipino (2000 1%) |            .             .
                   AIAN and Asian Indian |            .             .
            AIAN and other Asian race(s) |            .             .
                             AIAN and PI |            .             .
            AIAN and other race write_in |            .             .
                    Chinese and Hawaiian |            .             .
   Chinese, Filipino, Hawaiian (2000 1%) |            .             .
         Japanese and Hawaiian (2000 1%) |            .             .
                   Filipino and Hawaiian |            .             .
                Filipino and PI write_in |            .             .
          Asian write_in and PI write_in |            .             .
      Other Asian race(s) and PI race(s) |            .             .
               Japanese and Korean (ACS) |            .             .
         Chinese and other race write_in |            .             .
        Japanese and other race write_in |            .             .
        Filipino and other race write_in |            .             .
    Asian Indian and other race write_in |            .             .
  Asian write_in and other race write_in |            .             .
Other Asian race(s) and other race write |            .             .
                      Chinese and Korean |            .             .
            PI and other race write_in:  |            .             .
     PI write_in and other race write_in |            .             .
Other PI race(s) and other race write_in |            .             .
         Native Hawaiian or PI other rac |            .             .
                      White, Black, AIAN |            .             .
                     White, Black, Asian |            .             .
                        White, Black, PI |            .             .
       White, Black, other race write_in |            .             .
                      White, AIAN, Asian |            .             .
                         White, AIAN, PI |            .             .
        White, AIAN, other race write_in |            .             .
                White, Chinese, Hawaiian |            .             .
White, Chinese, Filipino, Hawaiian (2000 |            .             .
     White, Japanese, Hawaiian (2000 1%) |            .             .
               White, Filipino, Hawaiian |            .             .
  Other White, Asian race(s), PI race(s) |            .             .
                White, AIAN and Filipino |            .             .
              White, Black, and Filipino |            .             .
       White, Asian, other race write_in |            .             .
White, Filipino, other race write_in (20 |            .             .
White, Asian write_in, other race write_ |            .             .
Other White, Asian race(s), other race w |            .             .
          White, PI, other race write_in |            .             .
                      Black, AIAN, Asian |            .             .
                         Black, AIAN, PI |            .             .
        Black, AIAN, other race write_in |            .             .
                        Black, Asian, PI |            .             .
       Black, Asian, other race write_in |            .             .
          Black, PI, other race write_in |            .             .
                         AIAN, Asian, PI |            .             .
        AIAN, Asian, other race write_in |            .             .
           AIAN, PI, other race write_in |            .             .
          Asian, PI, other race write_in |            .             .
Asian (Chinese, Japanese, Korean, Vietna |            .             .
               White, Black, AIAN, Asian |            .             .
                  White, Black, AIAN, PI |            .             .
 White, Black, AIAN, other race write_in |            .             .
                 White, Black, Asian, PI |            .             .
White, Black, Asian, other race write_in |            .             .
   White, Black, PI, other race write_in |            .             .
                  White, AIAN, Asian, PI |            .             .
 White, AIAN, Asian, other race write_in |            .             .
    White, AIAN, PI, other race write_in |            .             .
   White, Asian, PI, other race write_in |            .             .
White, Chinese, Japanese, Native Hawaiia |            .             .
                  Black, AIAN, Asian, PI |            .             .
 Black, AIAN, Asian, other race write_in |            .             .
    Black, AIAN, PI, other race write_in |            .             .
   Black, Asian, PI, other race write_in |            .             .
    AIAN, Asian, PI, other race write_in |            .             .
Two specified Asian  (Chinese and other  |            .             .
           White, Black, AIAN, Asian, PI |            .             .
White, Black, AIAN, Asian, other race wr |            .             .
White, Black, AIAN, PI, other race write |            .             .
White, Black, Asian, PI, other race writ |            .             .
White, AIAN, Asian, PI, other race write |            .             .
Black, AIAN, Asian, PI, other race write |            .             .
White, Black, AIAN, Asian, PI, other rac |            .             .
White race; Some other race; Black or Af |            .             .
---------------------------------------------------------------------

---------------------------------------------------------------------
                                         |          raceombd         
                 Race [detailed version] | White/Latino   Black/Indig
-----------------------------------------+---------------------------
                                   White |      171,715             .
                             Black/Negro |            .             .
                                  Apache |            .             .
                               Blackfoot |            .             .
                                Cherokee |            .             .
                                Cheyenne |            .             .
                               Chickasaw |            .             .
                                Chippewa |            .             .
                                 Choctaw |            .             .
                                Comanche |            .             .
                                   Creek |            .             .
                                    Crow |            .             .
                                Iroquois |            .             .
                                   Kiowa |            .             .
                                  Lumbee |            .             .
                                  Navajo |            .             .
                                   Osage |            .             .
                                  Paiute |            .             .
                                    Pima |            .             .
                              Potawatomi |            .             .
                                  Pueblo |            .             .
                                Seminole |            .             .
                                Shoshone |            .             .
                                   Sioux |            .             .
       Tlingit (Tlingit_Haida, 2000/ACS) |            .             .
                          Tohono O Odham |            .             .
                 All other tribes (1990) |            .             .
                                    Hopi |            .             .
                                Delaware |            .             .
                   Latin American Indian |            .             .
                      Puget Sound Salish |            .             .
                                  Yakama |            .             .
                                   Yaqui |            .             .
                                Colville |            .             .
                                   Houma |            .             .
                               Menominee |            .             .
                                   Yuman |            .             .
                   South American Indian |            .             .
                 Mexican American Indian |            .             .
     Other Amer. Indian tribe (2000,ACS) |            .             .
       2+ Amer. Indian tribes (2000,ACS) |            .             .
                      Alaskan Athabaskan |            .             .
                                   Aleut |            .             .
                                  Eskimo |            .             .
                                 Inupiat |            .             .
                                  Yup'ik |            .             .
 Other Alaska Native tribe(s) (2000,ACS) |            .             .
Both Am. Ind. and Alaska Native (2000,AC |            .             .
                     Tribe not specified |            .             .
                                 Chinese |            .             .
                               Taiwanese |            .             .
                   Chinese and Taiwanese |            .             .
                                Japanese |            .             .
                                Filipino |            .             .
          Asian Indian (Hindu 1920_1940) |            .             .
                                  Korean |            .             .
                                Hawaiian |            .             .
                              Vietnamese |            .             .
                               Bhutanese |            .             .
                              Mongolian  |            .             .
                                Nepalese |            .             .
                               Cambodian |            .             .
                                   Hmong |            .             .
                                 Laotian |            .             .
                                    Thai |            .             .
                             Bangladeshi |            .             .
                                 Burmese |            .             .
                              Indonesian |            .             .
                               Malaysian |            .             .
                                Okinawan |            .             .
                               Pakistani |            .             .
                              Sri Lankan |            .             .
                     Other Asian, n.e.c. |            .             .
                    Asian, not specified |            .             .
                    Chinese and Japanese |            .             .
                    Chinese and Filipino |            .             .
                  Chinese and Vietnamese |            .             .
              Chinese and Asian write_in |            .             .
                   Japanese and Filipino |            .             .
         Asian Indian and Asian write_in |            .             .
           Other Asian race combinations |            .             .
                                  Samoan |            .             .
                                Tahitian |            .             .
                                  Tongan |            .             .
                 Other Polynesian (1990) |            .             .
    1+ other Polynesian races (2000,ACS) |            .             .
                      Guamanian/Chamorro |            .             .
               Northern Mariana Islander |            .             .
                                 Palauan |            .             .
                Other Micronesian (1990) |            .             .
   1+ other Micronesian races (2000,ACS) |            .             .
                                  Fijian |            .             .
                 Other Melanesian (1990) |            .             .
    1+ other Melanesian races (2000,ACS) |            .             .
          2+ PI races from 2+ PI regions |            .             .
                  Pacific Islander, n.s. |            .             .
                      Other race, n.e.c. |            .             .
                         White and Black |        1,351             .
                          White and AIAN |        2,910             .
                       White and Chinese |           96             .
                      White and Japanese |          165             .
                      White and Filipino |          358             .
                  White and Asian Indian |           40             .
                        White and Korean |           39             .
                    White and Vietnamese |           19             .
                White and Asian write_in |           91             .
           White and other Asian race(s) |           37             .
      White and two or more Asian groups |           32             .
               White and Native Hawaiian |           69             .
                        White and Samoan |           10             .
                     White and Guamanian |           41             .
                   White and PI write_in |           17             .
              White and other PI race(s) |            1             .
           White and other race write_in |       24,745             .
            White and other race, n.e.c. |            .             .
                          Black and AIAN |            .        26,904
                       Black and Chinese |            .             .
                      Black and Japanese |            .             .
                      Black and Filipino |            .             .
                  Black and Asian Indian |            .             .
                        Black and Korean |            .             .
                Black and Asian write_in |            .             .
           Black and other Asian race(s) |            .             .
                   Black and PI write_in |            .         2,107
              Black and other PI race(s) |            .           739
           Black and other race write_in |            .             .
             AIAN and Filipino (2000 1%) |            .             .
                   AIAN and Asian Indian |            .             .
            AIAN and other Asian race(s) |            .             .
                             AIAN and PI |            .             .
            AIAN and other race write_in |            .             .
                    Chinese and Hawaiian |            .             .
   Chinese, Filipino, Hawaiian (2000 1%) |            .             .
         Japanese and Hawaiian (2000 1%) |            .             .
                   Filipino and Hawaiian |            .             .
                Filipino and PI write_in |            .             .
          Asian write_in and PI write_in |            .             .
      Other Asian race(s) and PI race(s) |            .             .
               Japanese and Korean (ACS) |            .             .
         Chinese and other race write_in |            .             .
        Japanese and other race write_in |            .             .
        Filipino and other race write_in |            .             .
    Asian Indian and other race write_in |            .             .
  Asian write_in and other race write_in |            .             .
Other Asian race(s) and other race write |            .             .
                      Chinese and Korean |            .             .
            PI and other race write_in:  |            .             .
     PI write_in and other race write_in |            .             .
Other PI race(s) and other race write_in |            .             .
         Native Hawaiian or PI other rac |            .             .
                      White, Black, AIAN |          253             .
                     White, Black, Asian |           33             .
                        White, Black, PI |            4             .
       White, Black, other race write_in |          193             .
                      White, AIAN, Asian |           60             .
                         White, AIAN, PI |           20             .
        White, AIAN, other race write_in |          388             .
                White, Chinese, Hawaiian |           15             .
White, Chinese, Filipino, Hawaiian (2000 |            2             .
     White, Japanese, Hawaiian (2000 1%) |            1             .
               White, Filipino, Hawaiian |           10             .
  Other White, Asian race(s), PI race(s) |           22             .
                White, AIAN and Filipino |            4             .
              White, Black, and Filipino |            2             .
       White, Asian, other race write_in |          100             .
White, Filipino, other race write_in (20 |            .             .
White, Asian write_in, other race write_ |            .             .
Other White, Asian race(s), other race w |          110             .
          White, PI, other race write_in |           52             .
                      Black, AIAN, Asian |            .             .
                         Black, AIAN, PI |            .             .
        Black, AIAN, other race write_in |            .             .
                        Black, Asian, PI |            .             .
       Black, Asian, other race write_in |            .             .
          Black, PI, other race write_in |            .             .
                         AIAN, Asian, PI |            .             .
        AIAN, Asian, other race write_in |            .             .
           AIAN, PI, other race write_in |            .             .
          Asian, PI, other race write_in |            .             .
Asian (Chinese, Japanese, Korean, Vietna |            .             .
               White, Black, AIAN, Asian |           13             .
                  White, Black, AIAN, PI |            1             .
 White, Black, AIAN, other race write_in |           20             .
                 White, Black, Asian, PI |            3             .
White, Black, Asian, other race write_in |            4             .
   White, Black, PI, other race write_in |            .             .
                  White, AIAN, Asian, PI |            6             .
 White, AIAN, Asian, other race write_in |            6             .
    White, AIAN, PI, other race write_in |            1             .
   White, Asian, PI, other race write_in |           36             .
White, Chinese, Japanese, Native Hawaiia |            .             .
                  Black, AIAN, Asian, PI |            .             .
 Black, AIAN, Asian, other race write_in |            .             .
    Black, AIAN, PI, other race write_in |            .             .
   Black, Asian, PI, other race write_in |            .             .
    AIAN, Asian, PI, other race write_in |            .             .
Two specified Asian  (Chinese and other  |            .             .
           White, Black, AIAN, Asian, PI |            2             .
White, Black, AIAN, Asian, other race wr |            1             .
White, Black, AIAN, PI, other race write |            .             .
White, Black, Asian, PI, other race writ |            .             .
White, AIAN, Asian, PI, other race write |            .             .
Black, AIAN, Asian, PI, other race write |            .             .
White, Black, AIAN, Asian, PI, other rac |            2             .
White race; Some other race; Black or Af |            .             .
---------------------------------------------------------------------

---------------------------------------------------------------------
                                         |          raceombd         
                 Race [detailed version] |  Black/Asian  Black/Latino
-----------------------------------------+---------------------------
                                   White |            .             .
                             Black/Negro |            .        18,919
                                  Apache |            .             .
                               Blackfoot |            .             .
                                Cherokee |            .             .
                                Cheyenne |            .             .
                               Chickasaw |            .             .
                                Chippewa |            .             .
                                 Choctaw |            .             .
                                Comanche |            .             .
                                   Creek |            .             .
                                    Crow |            .             .
                                Iroquois |            .             .
                                   Kiowa |            .             .
                                  Lumbee |            .             .
                                  Navajo |            .             .
                                   Osage |            .             .
                                  Paiute |            .             .
                                    Pima |            .             .
                              Potawatomi |            .             .
                                  Pueblo |            .             .
                                Seminole |            .             .
                                Shoshone |            .             .
                                   Sioux |            .             .
       Tlingit (Tlingit_Haida, 2000/ACS) |            .             .
                          Tohono O Odham |            .             .
                 All other tribes (1990) |            .             .
                                    Hopi |            .             .
                                Delaware |            .             .
                   Latin American Indian |            .             .
                      Puget Sound Salish |            .             .
                                  Yakama |            .             .
                                   Yaqui |            .             .
                                Colville |            .             .
                                   Houma |            .             .
                               Menominee |            .             .
                                   Yuman |            .             .
                   South American Indian |            .             .
                 Mexican American Indian |            .             .
     Other Amer. Indian tribe (2000,ACS) |            .             .
       2+ Amer. Indian tribes (2000,ACS) |            .             .
                      Alaskan Athabaskan |            .             .
                                   Aleut |            .             .
                                  Eskimo |            .             .
                                 Inupiat |            .             .
                                  Yup'ik |            .             .
 Other Alaska Native tribe(s) (2000,ACS) |            .             .
Both Am. Ind. and Alaska Native (2000,AC |            .             .
                     Tribe not specified |            .             .
                                 Chinese |            .             .
                               Taiwanese |            .             .
                   Chinese and Taiwanese |            .             .
                                Japanese |            .             .
                                Filipino |            .             .
          Asian Indian (Hindu 1920_1940) |            .             .
                                  Korean |            .             .
                                Hawaiian |            .             .
                              Vietnamese |            .             .
                               Bhutanese |            .             .
                              Mongolian  |            .             .
                                Nepalese |            .             .
                               Cambodian |            .             .
                                   Hmong |            .             .
                                 Laotian |            .             .
                                    Thai |            .             .
                             Bangladeshi |            .             .
                                 Burmese |            .             .
                              Indonesian |            .             .
                               Malaysian |            .             .
                                Okinawan |            .             .
                               Pakistani |            .             .
                              Sri Lankan |            .             .
                     Other Asian, n.e.c. |            .             .
                    Asian, not specified |            .             .
                    Chinese and Japanese |            .             .
                    Chinese and Filipino |            .             .
                  Chinese and Vietnamese |            .             .
              Chinese and Asian write_in |            .             .
                   Japanese and Filipino |            .             .
         Asian Indian and Asian write_in |            .             .
           Other Asian race combinations |            .             .
                                  Samoan |            .             .
                                Tahitian |            .             .
                                  Tongan |            .             .
                 Other Polynesian (1990) |            .             .
    1+ other Polynesian races (2000,ACS) |            .             .
                      Guamanian/Chamorro |            .             .
               Northern Mariana Islander |            .             .
                                 Palauan |            .             .
                Other Micronesian (1990) |            .             .
   1+ other Micronesian races (2000,ACS) |            .             .
                                  Fijian |            .             .
                 Other Melanesian (1990) |            .             .
    1+ other Melanesian races (2000,ACS) |            .             .
          2+ PI races from 2+ PI regions |            .             .
                  Pacific Islander, n.s. |            .             .
                      Other race, n.e.c. |            .             .
                         White and Black |            .         4,566
                          White and AIAN |            .             .
                       White and Chinese |            .             .
                      White and Japanese |            .             .
                      White and Filipino |            .             .
                  White and Asian Indian |            .             .
                        White and Korean |            .             .
                    White and Vietnamese |            .             .
                White and Asian write_in |            .             .
           White and other Asian race(s) |            .             .
      White and two or more Asian groups |            .             .
               White and Native Hawaiian |            .             .
                        White and Samoan |            .             .
                     White and Guamanian |            .             .
                   White and PI write_in |            .             .
              White and other PI race(s) |            .             .
           White and other race write_in |            .             .
            White and other race, n.e.c. |            .             .
                          Black and AIAN |            .           462
                       Black and Chinese |        1,524            36
                      Black and Japanese |        1,734            18
                      Black and Filipino |        4,004            57
                  Black and Asian Indian |        2,308            11
                        Black and Korean |        1,619            21
                Black and Asian write_in |        1,928            12
           Black and other Asian race(s) |        1,212            10
                   Black and PI write_in |            .            23
              Black and other PI race(s) |            .            10
           Black and other race write_in |            .         6,942
             AIAN and Filipino (2000 1%) |            .             .
                   AIAN and Asian Indian |            .             .
            AIAN and other Asian race(s) |            .             .
                             AIAN and PI |            .             .
            AIAN and other race write_in |            .             .
                    Chinese and Hawaiian |            .             .
   Chinese, Filipino, Hawaiian (2000 1%) |            .             .
         Japanese and Hawaiian (2000 1%) |            .             .
                   Filipino and Hawaiian |            .             .
                Filipino and PI write_in |            .             .
          Asian write_in and PI write_in |            .             .
      Other Asian race(s) and PI race(s) |            .             .
               Japanese and Korean (ACS) |            .             .
         Chinese and other race write_in |            .             .
        Japanese and other race write_in |            .             .
        Filipino and other race write_in |            .             .
    Asian Indian and other race write_in |            .             .
  Asian write_in and other race write_in |            .             .
Other Asian race(s) and other race write |            .             .
                      Chinese and Korean |            .             .
            PI and other race write_in:  |            .             .
     PI write_in and other race write_in |            .             .
Other PI race(s) and other race write_in |            .             .
         Native Hawaiian or PI other rac |            .             .
                      White, Black, AIAN |            .           425
                     White, Black, Asian |            .            52
                        White, Black, PI |            .             8
       White, Black, other race write_in |            .             .
                      White, AIAN, Asian |            .             .
                         White, AIAN, PI |            .             .
        White, AIAN, other race write_in |            .             .
                White, Chinese, Hawaiian |            .             .
White, Chinese, Filipino, Hawaiian (2000 |            .             .
     White, Japanese, Hawaiian (2000 1%) |            .             .
               White, Filipino, Hawaiian |            .             .
  Other White, Asian race(s), PI race(s) |            .             .
                White, AIAN and Filipino |            .             .
              White, Black, and Filipino |            .             .
       White, Asian, other race write_in |            .             .
White, Filipino, other race write_in (20 |            .             .
White, Asian write_in, other race write_ |            .             .
Other White, Asian race(s), other race w |            .             .
          White, PI, other race write_in |            .             .
                      Black, AIAN, Asian |            .            13
                         Black, AIAN, PI |            .            11
        Black, AIAN, other race write_in |            .            70
                        Black, Asian, PI |            .             4
       Black, Asian, other race write_in |            .            38
          Black, PI, other race write_in |            .            14
                         AIAN, Asian, PI |            .             .
        AIAN, Asian, other race write_in |            .             .
           AIAN, PI, other race write_in |            .             .
          Asian, PI, other race write_in |            .             .
Asian (Chinese, Japanese, Korean, Vietna |            .             .
               White, Black, AIAN, Asian |            .            19
                  White, Black, AIAN, PI |            .             3
 White, Black, AIAN, other race write_in |            .            36
                 White, Black, Asian, PI |            .             1
White, Black, Asian, other race write_in |            .             3
   White, Black, PI, other race write_in |            .             1
                  White, AIAN, Asian, PI |            .             .
 White, AIAN, Asian, other race write_in |            .             .
    White, AIAN, PI, other race write_in |            .             .
   White, Asian, PI, other race write_in |            .             .
White, Chinese, Japanese, Native Hawaiia |            .             .
                  Black, AIAN, Asian, PI |            .             .
 Black, AIAN, Asian, other race write_in |            .             1
    Black, AIAN, PI, other race write_in |            .             3
   Black, Asian, PI, other race write_in |            .            10
    AIAN, Asian, PI, other race write_in |            .             .
Two specified Asian  (Chinese and other  |            .             .
           White, Black, AIAN, Asian, PI |            .             1
White, Black, AIAN, Asian, other race wr |            .             7
White, Black, AIAN, PI, other race write |            .             .
White, Black, Asian, PI, other race writ |            .             8
White, AIAN, Asian, PI, other race write |            .             .
Black, AIAN, Asian, PI, other race write |            .             .
White, Black, AIAN, Asian, PI, other rac |            .            14
White race; Some other race; Black or Af |            .             .
---------------------------------------------------------------------

---------------------------------------------------------------------
                                         |          raceombd         
                 Race [detailed version] |  Indig/Asian  Indig/Latino
-----------------------------------------+---------------------------
                                   White |            .             .
                             Black/Negro |            .             .
                                  Apache |            .           733
                               Blackfoot |            .            78
                                Cherokee |            .           578
                                Cheyenne |            .            32
                               Chickasaw |            .            32
                                Chippewa |            .           160
                                 Choctaw |            .           154
                                Comanche |            .            74
                                   Creek |            .            65
                                    Crow |            .            17
                                Iroquois |            .           119
                                   Kiowa |            .            10
                                  Lumbee |            .            28
                                  Navajo |            .           672
                                   Osage |            .             1
                                  Paiute |            .            46
                                    Pima |            .            85
                              Potawatomi |            .            40
                                  Pueblo |            .           291
                                Seminole |            .            44
                                Shoshone |            .            32
                                   Sioux |            .           282
       Tlingit (Tlingit_Haida, 2000/ACS) |            .            24
                          Tohono O Odham |            .           154
                 All other tribes (1990) |            .           911
                                    Hopi |            .             4
                                Delaware |            .             7
                   Latin American Indian |            .           553
                      Puget Sound Salish |            .            41
                                  Yakama |            .             3
                                   Yaqui |            .           376
                                Colville |            .             3
                                   Houma |            .             2
                               Menominee |            .             8
                                   Yuman |            .            29
                   South American Indian |            .            14
                 Mexican American Indian |            .            16
     Other Amer. Indian tribe (2000,ACS) |            .         1,715
       2+ Amer. Indian tribes (2000,ACS) |            .           377
                      Alaskan Athabaskan |            .            29
                                   Aleut |            .            23
                                  Eskimo |            .            72
                                 Inupiat |            .             2
                                  Yup'ik |            .             3
 Other Alaska Native tribe(s) (2000,ACS) |            .            16
Both Am. Ind. and Alaska Native (2000,AC |            .           229
                     Tribe not specified |            .         1,489
                                 Chinese |            .             .
                               Taiwanese |            .             .
                   Chinese and Taiwanese |            .             .
                                Japanese |            .             .
                                Filipino |            .             .
          Asian Indian (Hindu 1920_1940) |            .             .
                                  Korean |            .             .
                                Hawaiian |            .             .
                              Vietnamese |            .             .
                               Bhutanese |            .             .
                              Mongolian  |            .             .
                                Nepalese |            .             .
                               Cambodian |            .             .
                                   Hmong |            .             .
                                 Laotian |            .             .
                                    Thai |            .             .
                             Bangladeshi |            .             .
                                 Burmese |            .             .
                              Indonesian |            .             .
                               Malaysian |            .             .
                                Okinawan |            .             .
                               Pakistani |            .             .
                              Sri Lankan |            .             .
                     Other Asian, n.e.c. |            .             .
                    Asian, not specified |            .             .
                    Chinese and Japanese |            .             .
                    Chinese and Filipino |            .             .
                  Chinese and Vietnamese |            .             .
              Chinese and Asian write_in |            .             .
                   Japanese and Filipino |            .             .
         Asian Indian and Asian write_in |            .             .
           Other Asian race combinations |            .             .
                                  Samoan |            .           111
                                Tahitian |            .             .
                                  Tongan |            .            26
                 Other Polynesian (1990) |            .             1
    1+ other Polynesian races (2000,ACS) |            .            16
                      Guamanian/Chamorro |            .           281
               Northern Mariana Islander |            .             .
                                 Palauan |            .             .
                Other Micronesian (1990) |            .             1
   1+ other Micronesian races (2000,ACS) |            .             7
                                  Fijian |            .             1
                 Other Melanesian (1990) |            .             .
    1+ other Melanesian races (2000,ACS) |            .             3
          2+ PI races from 2+ PI regions |            .             5
                  Pacific Islander, n.s. |            .            26
                      Other race, n.e.c. |            .             .
                         White and Black |            .             .
                          White and AIAN |            .         3,935
                       White and Chinese |            .             .
                      White and Japanese |            .             .
                      White and Filipino |            .             .
                  White and Asian Indian |            .             .
                        White and Korean |            .             .
                    White and Vietnamese |            .             .
                White and Asian write_in |            .             .
           White and other Asian race(s) |            .             .
      White and two or more Asian groups |            .             .
               White and Native Hawaiian |            .           328
                        White and Samoan |            .            97
                     White and Guamanian |            .           115
                   White and PI write_in |            .            44
              White and other PI race(s) |            .            14
           White and other race write_in |            .             .
            White and other race, n.e.c. |            .             .
                          Black and AIAN |            .           290
                       Black and Chinese |            .             .
                      Black and Japanese |            .             .
                      Black and Filipino |            .             .
                  Black and Asian Indian |            .             .
                        Black and Korean |            .             .
                Black and Asian write_in |            .             .
           Black and other Asian race(s) |            .             .
                   Black and PI write_in |            .            16
              Black and other PI race(s) |            .            13
           Black and other race write_in |            .             .
             AIAN and Filipino (2000 1%) |           78             .
                   AIAN and Asian Indian |          606             .
            AIAN and other Asian race(s) |        3,624             .
                             AIAN and PI |            .            42
            AIAN and other race write_in |            .             .
                    Chinese and Hawaiian |        2,858            25
   Chinese, Filipino, Hawaiian (2000 1%) |          591            15
         Japanese and Hawaiian (2000 1%) |          845             8
                   Filipino and Hawaiian |        2,543            34
                Filipino and PI write_in |        1,119             1
          Asian write_in and PI write_in |        4,585            23
      Other Asian race(s) and PI race(s) |        4,809            47
               Japanese and Korean (ACS) |            .             .
         Chinese and other race write_in |            .             .
        Japanese and other race write_in |            .             .
        Filipino and other race write_in |            .             .
    Asian Indian and other race write_in |            .             .
  Asian write_in and other race write_in |            .             .
Other Asian race(s) and other race write |            .             .
                      Chinese and Korean |            .             .
            PI and other race write_in:  |            .             4
     PI write_in and other race write_in |            .             9
Other PI race(s) and other race write_in |            .           468
         Native Hawaiian or PI other rac |            .            10
                      White, Black, AIAN |            .           198
                     White, Black, Asian |            .             .
                        White, Black, PI |            .            18
       White, Black, other race write_in |            .             .
                      White, AIAN, Asian |            .             .
                         White, AIAN, PI |            .            50
        White, AIAN, other race write_in |            .           531
                White, Chinese, Hawaiian |            .            48
White, Chinese, Filipino, Hawaiian (2000 |            .            27
     White, Japanese, Hawaiian (2000 1%) |            .             7
               White, Filipino, Hawaiian |            .            42
  Other White, Asian race(s), PI race(s) |            .            76
                White, AIAN and Filipino |            .             .
              White, Black, and Filipino |            .             .
       White, Asian, other race write_in |            .             .
White, Filipino, other race write_in (20 |            .             .
White, Asian write_in, other race write_ |            .             .
Other White, Asian race(s), other race w |            .             .
          White, PI, other race write_in |            .           137
                      Black, AIAN, Asian |            .             5
                         Black, AIAN, PI |            .             3
        Black, AIAN, other race write_in |            .            63
                        Black, Asian, PI |            .            11
       Black, Asian, other race write_in |            .             .
          Black, PI, other race write_in |            .             .
                         AIAN, Asian, PI |            .            11
        AIAN, Asian, other race write_in |            .            10
           AIAN, PI, other race write_in |            .             7
          Asian, PI, other race write_in |            .            32
Asian (Chinese, Japanese, Korean, Vietna |            .             .
               White, Black, AIAN, Asian |            .             3
                  White, Black, AIAN, PI |            .             .
 White, Black, AIAN, other race write_in |            .            24
                 White, Black, Asian, PI |            .             2
White, Black, Asian, other race write_in |            .             .
   White, Black, PI, other race write_in |            .             4
                  White, AIAN, Asian, PI |            .            48
 White, AIAN, Asian, other race write_in |            .            10
    White, AIAN, PI, other race write_in |            .            13
   White, Asian, PI, other race write_in |            .            29
White, Chinese, Japanese, Native Hawaiia |            .             .
                  Black, AIAN, Asian, PI |            .             6
 Black, AIAN, Asian, other race write_in |            .             .
    Black, AIAN, PI, other race write_in |            .             .
   Black, Asian, PI, other race write_in |            .             1
    AIAN, Asian, PI, other race write_in |            .             3
Two specified Asian  (Chinese and other  |            .             5
           White, Black, AIAN, Asian, PI |            .             3
White, Black, AIAN, Asian, other race wr |            .             1
White, Black, AIAN, PI, other race write |            .             2
White, Black, Asian, PI, other race writ |            .             6
White, AIAN, Asian, PI, other race write |            .             3
Black, AIAN, Asian, PI, other race write |            .             5
White, Black, AIAN, Asian, PI, other rac |            .            27
White race; Some other race; Black or Af |            .             .
---------------------------------------------------------------------

---------------------------------------------------------------------
                                         |          raceombd         
                 Race [detailed version] | Asian/Latino         Other
-----------------------------------------+---------------------------
                                   White |            .             .
                             Black/Negro |            .             .
                                  Apache |            .             .
                               Blackfoot |            .             .
                                Cherokee |            .             .
                                Cheyenne |            .             .
                               Chickasaw |            .             .
                                Chippewa |            .             .
                                 Choctaw |            .             .
                                Comanche |            .             .
                                   Creek |            .             .
                                    Crow |            .             .
                                Iroquois |            .             .
                                   Kiowa |            .             .
                                  Lumbee |            .             .
                                  Navajo |            .             .
                                   Osage |            .             .
                                  Paiute |            .             .
                                    Pima |            .             .
                              Potawatomi |            .             .
                                  Pueblo |            .             .
                                Seminole |            .             .
                                Shoshone |            .             .
                                   Sioux |            .             .
       Tlingit (Tlingit_Haida, 2000/ACS) |            .             .
                          Tohono O Odham |            .             .
                 All other tribes (1990) |            .             .
                                    Hopi |            .             .
                                Delaware |            .             .
                   Latin American Indian |            .             .
                      Puget Sound Salish |            .             .
                                  Yakama |            .             .
                                   Yaqui |            .             .
                                Colville |            .             .
                                   Houma |            .             .
                               Menominee |            .             .
                                   Yuman |            .             .
                   South American Indian |            .             .
                 Mexican American Indian |            .             .
     Other Amer. Indian tribe (2000,ACS) |            .             .
       2+ Amer. Indian tribes (2000,ACS) |            .             .
                      Alaskan Athabaskan |            .             .
                                   Aleut |            .             .
                                  Eskimo |            .             .
                                 Inupiat |            .             .
                                  Yup'ik |            .             .
 Other Alaska Native tribe(s) (2000,ACS) |            .             .
Both Am. Ind. and Alaska Native (2000,AC |            .             .
                     Tribe not specified |            .             .
                                 Chinese |        1,127             .
                               Taiwanese |            5             .
                   Chinese and Taiwanese |            .             .
                                Japanese |        1,244             .
                                Filipino |        3,728             .
          Asian Indian (Hindu 1920_1940) |          229             .
                                  Korean |          500             .
                                Hawaiian |           25             .
                              Vietnamese |          243             .
                               Bhutanese |            .             .
                              Mongolian  |            .             .
                                Nepalese |            1             .
                               Cambodian |           66             .
                                   Hmong |            6             .
                                 Laotian |           73             .
                                    Thai |           99             .
                             Bangladeshi |            4             .
                                 Burmese |            .             .
                              Indonesian |           19             .
                               Malaysian |            6             .
                                Okinawan |            4             .
                               Pakistani |           56             .
                              Sri Lankan |            4             .
                     Other Asian, n.e.c. |           46             .
                    Asian, not specified |           37             .
                    Chinese and Japanese |           11             .
                    Chinese and Filipino |           66             .
                  Chinese and Vietnamese |            9             .
              Chinese and Asian write_in |           13             .
                   Japanese and Filipino |           43             .
         Asian Indian and Asian write_in |            9             .
           Other Asian race combinations |           84             .
                                  Samoan |            .             .
                                Tahitian |            .             .
                                  Tongan |            .             .
                 Other Polynesian (1990) |            .             .
    1+ other Polynesian races (2000,ACS) |            .             .
                      Guamanian/Chamorro |            .             .
               Northern Mariana Islander |            .             .
                                 Palauan |            .             .
                Other Micronesian (1990) |            .             .
   1+ other Micronesian races (2000,ACS) |            .             .
                                  Fijian |            .             .
                 Other Melanesian (1990) |            .             .
    1+ other Melanesian races (2000,ACS) |            .             .
          2+ PI races from 2+ PI regions |            .             .
                  Pacific Islander, n.s. |            .             .
                      Other race, n.e.c. |            .        73,890
                         White and Black |            .             .
                          White and AIAN |            .             .
                       White and Chinese |          762             .
                      White and Japanese |          886             .
                      White and Filipino |        1,927             .
                  White and Asian Indian |          181             .
                        White and Korean |          324             .
                    White and Vietnamese |          175             .
                White and Asian write_in |          228             .
           White and other Asian race(s) |          110             .
      White and two or more Asian groups |          111             .
               White and Native Hawaiian |            .             .
                        White and Samoan |            .             .
                     White and Guamanian |            .             .
                   White and PI write_in |            .             .
              White and other PI race(s) |            .             .
           White and other race write_in |            .        47,952
            White and other race, n.e.c. |            .             3
                          Black and AIAN |            .             .
                       Black and Chinese |           41             .
                      Black and Japanese |           35             .
                      Black and Filipino |           61             .
                  Black and Asian Indian |           12             .
                        Black and Korean |           20             .
                Black and Asian write_in |           15             .
           Black and other Asian race(s) |           11             .
                   Black and PI write_in |            .             .
              Black and other PI race(s) |            .             .
           Black and other race write_in |            .        17,111
             AIAN and Filipino (2000 1%) |            5             .
                   AIAN and Asian Indian |            2             .
            AIAN and other Asian race(s) |          215             .
                             AIAN and PI |            .           630
            AIAN and other race write_in |            .         1,775
                    Chinese and Hawaiian |            8             .
   Chinese, Filipino, Hawaiian (2000 1%) |            4             .
         Japanese and Hawaiian (2000 1%) |            1             .
                   Filipino and Hawaiian |           30             .
                Filipino and PI write_in |           19             .
          Asian write_in and PI write_in |           61             .
      Other Asian race(s) and PI race(s) |           39             .
               Japanese and Korean (ACS) |            .             1
         Chinese and other race write_in |          630           697
        Japanese and other race write_in |          315           181
        Filipino and other race write_in |        2,104         1,893
    Asian Indian and other race write_in |          171         3,811
  Asian write_in and other race write_in |          438         3,573
Other Asian race(s) and other race write |          874         4,854
                      Chinese and Korean |            .           156
            PI and other race write_in:  |            .            71
     PI write_in and other race write_in |            .           252
Other PI race(s) and other race write_in |            .           625
         Native Hawaiian or PI other rac |            .            86
                      White, Black, AIAN |            .        16,594
                     White, Black, Asian |          108         3,612
                        White, Black, PI |            .           498
       White, Black, other race write_in |            .         2,585
                      White, AIAN, Asian |          202         3,121
                         White, AIAN, PI |            .           609
        White, AIAN, other race write_in |            .         1,291
                White, Chinese, Hawaiian |           16         3,632
White, Chinese, Filipino, Hawaiian (2000 |           10           827
     White, Japanese, Hawaiian (2000 1%) |           13           857
               White, Filipino, Hawaiian |           32         1,746
  Other White, Asian race(s), PI race(s) |           66         6,432
                White, AIAN and Filipino |            4           107
              White, Black, and Filipino |           10           133
       White, Asian, other race write_in |          316         1,327
White, Filipino, other race write_in (20 |            2           108
White, Asian write_in, other race write_ |            2            89
Other White, Asian race(s), other race w |          493           605
          White, PI, other race write_in |           27           606
                      Black, AIAN, Asian |           17           591
                         Black, AIAN, PI |            .            88
        Black, AIAN, other race write_in |            .           442
                        Black, Asian, PI |            5           420
       Black, Asian, other race write_in |           66           452
          Black, PI, other race write_in |            .            63
                         AIAN, Asian, PI |           10           222
        AIAN, Asian, other race write_in |           42            63
           AIAN, PI, other race write_in |            .             9
          Asian, PI, other race write_in |           73           380
Asian (Chinese, Japanese, Korean, Vietna |            .           184
               White, Black, AIAN, Asian |           31         1,132
                  White, Black, AIAN, PI |            .           145
 White, Black, AIAN, other race write_in |            .           254
                 White, Black, Asian, PI |            4           239
White, Black, Asian, other race write_in |            8           110
   White, Black, PI, other race write_in |            .            16
                  White, AIAN, Asian, PI |           12           890
 White, AIAN, Asian, other race write_in |           22            66
    White, AIAN, PI, other race write_in |            .            18
   White, Asian, PI, other race write_in |           73         1,410
White, Chinese, Japanese, Native Hawaiia |            .            93
                  Black, AIAN, Asian, PI |            2            50
 Black, AIAN, Asian, other race write_in |            2            17
    Black, AIAN, PI, other race write_in |            .             7
   Black, Asian, PI, other race write_in |            3           140
    AIAN, Asian, PI, other race write_in |           17           193
Two specified Asian  (Chinese and other  |          121           344
           White, Black, AIAN, Asian, PI |            .           153
White, Black, AIAN, Asian, other race wr |            1            29
White, Black, AIAN, PI, other race write |            .            47
White, Black, Asian, PI, other race writ |            1           119
White, AIAN, Asian, PI, other race write |            2            22
Black, AIAN, Asian, PI, other race write |            2           138
White, Black, AIAN, Asian, PI, other rac |           20           222
White race; Some other race; Black or Af |            .             2
---------------------------------------------------------------------

. table raceshort latino, missing

-------------------------------
           |       latino      
 raceshort |        0         1
-----------+-------------------
     White | 3.83e+07         .
     Black |  5300690         .
Indigenous |  504,300         .
     Asian |  1885971         .
    Latino |        .   5120068
  Multiple |  687,336   271,496
     Other |   73,890         .
-------------------------------

. table race raceshort, missing

------------------------------------------------------------------------------
                                 |                  raceshort                 
          Race [general version] |      White      Black Indigenous      Asian
---------------------------------+--------------------------------------------
                           White |   3.83e+07          .          .          .
                     Black/Negro |          .    5300690          .          .
American Indian or Alaska Native |          .          .    441,727          .
                         Chinese |          .          .          .    459,017
                        Japanese |          .          .          .    155,194
 Other Asian or Pacific Islander |          .          .     62,573    1271760
                 Other race, nec |          .          .          .          .
                 Two major races |          .          .          .          .
       Three or more major races |          .          .          .          .
------------------------------------------------------------------------------

-------------------------------------------------------------------
                                 |            raceshort            
          Race [general version] |     Latino   Multiple      Other
---------------------------------+---------------------------------
                           White |    2790401    171,715          .
                     Black/Negro |     81,137     18,919          .
American Indian or Alaska Native |     43,313      9,673          .
                         Chinese |      1,699      1,132          .
                        Japanese |        953      1,244          .
 Other Asian or Pacific Islander |     16,330      5,859          .
                 Other race, nec |    2010246          .     73,890
                 Two major races |    163,956    691,329          .
       Three or more major races |     12,033     58,961          .
-------------------------------------------------------------------

. table raceombd raceshort, missing

-------------------------------------------------------------------------
             |                         raceshort                         
    raceombd |      White       Black  Indigenous       Asian      Latino
-------------+-----------------------------------------------------------
       White |   3.83e+07           .           .           .           .
       Black |          .     5300690           .           .           .
       Indig |          .           .     504,300           .           .
       Asian |          .           .           .     1885971           .
      Latino |          .           .           .           .     5120068
 White/Black |          .           .           .           .           .
 White/Indig |          .           .           .           .           .
 White/Asian |          .           .           .           .           .
White/Latino |          .           .           .           .           .
 Black/Indig |          .           .           .           .           .
 Black/Asian |          .           .           .           .           .
Black/Latino |          .           .           .           .           .
 Indig/Asian |          .           .           .           .           .
Indig/Latino |          .           .           .           .           .
Asian/Latino |          .           .           .           .           .
       Other |          .           .           .           .           .
-------------------------------------------------------------------------

-------------------------------------
             |       raceshort       
    raceombd |   Multiple       Other
-------------+-----------------------
       White |          .           .
       Black |          .           .
       Indig |          .           .
       Asian |          .           .
      Latino |          .           .
 White/Black |    135,304           .
 White/Indig |    207,679           .
 White/Asian |    141,396           .
White/Latino |    203,100           .
 Black/Indig |     29,750           .
 Black/Asian |     14,329           .
Black/Latino |     31,829           .
 Indig/Asian |     21,658           .
Indig/Latino |     17,160           .
Asian/Latino |     19,407           .
       Other |    137,220      73,890
-------------------------------------

. table raceancd raceanc, missing

-------------------------------------------------------------------------
             |                          raceanc                          
    raceancd |      White       Black  Indigenous       Asian      Latino
-------------+-----------------------------------------------------------
       White |   2.77e+07           .           .           .           .
       Black |          .     4678800           .           .           .
       Indig |          .           .     840,284           .           .
       Asian |          .           .           .     1896068           .
      Latino |          .           .           .           .     4664539
 White/Black |          .           .           .           .           .
 White/Indig |          .           .           .           .           .
 White/Asian |          .           .           .           .           .
White/Latino |          .           .           .           .           .
 Black/Indig |          .           .           .           .           .
 Black/Asian |          .           .           .           .           .
Black/Latino |          .           .           .           .           .
 Indig/Asian |          .           .           .           .           .
Indig/Latino |          .           .           .           .           .
Asian/Latino |          .           .           .           .           .
-------------------------------------------------------------------------

-------------------------
             |  raceanc  
    raceancd |   Multiple
-------------+-----------
       White |          .
       Black |          .
       Indig |          .
       Asian |          .
      Latino |          .
 White/Black |    102,692
 White/Indig |    1085535
 White/Asian |    123,833
White/Latino |    305,887
 Black/Indig |     82,040
 Black/Asian |     17,667
Black/Latino |     46,027
 Indig/Asian |     31,045
Indig/Latino |     42,537
Asian/Latino |     29,761
-------------------------

. table raceancd raceombd, missing

-------------------------------------------------------------------------------
             |                             raceombd                            
    raceancd |        White        Black        Indig        Asian       Latino
-------------+-----------------------------------------------------------------
       White |     2.74e+07       31,583       13,955        6,026       92,329
       Black |       25,386      4541758        3,081        6,515       22,271
       Indig |      315,483       22,270      388,671       23,197       16,576
       Asian |       42,263        4,755        3,294      1748430       10,341
      Latino |       79,615        6,962        1,504          458      4558802
 White/Black |       15,449       31,645          204           65        1,984
 White/Indig |      940,499        5,799       39,814          376        6,452
 White/Asian |       43,930          395          332       15,323        2,407
White/Latino |       74,217          435          149           41       24,618
 Black/Indig |        2,666       52,605        1,764          159        1,287
 Black/Asian |          210        4,688           48        2,230          500
Black/Latino |          414        6,908           14           14        5,062
 Indig/Asian |        2,153          270        4,869        2,696        2,029
Indig/Latino |        3,886          447        1,564           25       18,335
Asian/Latino |          926           73           47        1,378        6,491
-------------------------------------------------------------------------------

-------------------------------------------------------------------------------
             |                             raceombd                            
    raceancd |  White/Black  White/Indig  White/Asian White/Latino  Black/Indig
-------------+-----------------------------------------------------------------
       White |       20,439       47,112       20,360            .          232
       Black |       38,667          222          163            .        6,860
       Indig |          888       54,450          577            .        4,368
       Asian |          144          199       51,472            .           54
      Latino |          341          288           71            .           32
 White/Black |       43,634          274           79            .          420
 White/Indig |        2,498       80,576        1,131            .          616
 White/Asian |          125          213       54,942            .            2
White/Latino |          248          258           83      203,100           13
 Black/Indig |        2,723          326            8            .       14,280
 Black/Asian |          171            2          160            .           63
Black/Latino |          506            4            4            .           60
 Indig/Asian |            8          471          849            .           35
Indig/Latino |           46          432           12            .           41
Asian/Latino |            6            6          401            .            .
-------------------------------------------------------------------------------

-------------------------------------------------------------------------------
             |                             raceombd                            
    raceancd |  Black/Asian Black/Latino  Indig/Asian Indig/Latino Asian/Latino
-------------+-----------------------------------------------------------------
       White |           81            .          122            .            .
       Black |        2,319            .          152            .            .
       Indig |           79            .        2,825            .            .
       Asian |        3,255            .        7,247            .            .
      Latino |            7            .            8            .            .
 White/Black |           75            .            2            .            .
 White/Indig |           10            .          226            .            .
 White/Asian |          114            .          383            .            .
White/Latino |            .            .            3            .            .
 Black/Indig |          125            .            6            .            .
 Black/Asian |        7,014            .           65            .            .
Black/Latino |           19       31,829            2            .            .
 Indig/Asian |           77            .        9,118            .            .
Indig/Latino |            .            .           14       17,160            .
Asian/Latino |           31            .           35            .       19,407
-------------------------------------------------------------------------------

---------------------------
             |   raceombd  
    raceancd |        Other
-------------+-------------
       White |       46,380
       Black |       31,406
       Indig |       10,900
       Asian |       24,614
      Latino |       16,451
 White/Black |        8,861
 White/Indig |        7,538
 White/Asian |        5,667
White/Latino |        2,722
 Black/Indig |        6,091
 Black/Asian |        2,516
Black/Latino |        1,191
 Indig/Asian |        8,470
Indig/Latino |          575
Asian/Latino |          960
---------------------------

. table rancestry1 rancestry1s, missing

----------------------------------------------------------------------
rancestry |                        rancestry1s                        
1         |      White       Black  Indigenous       Asian      Latino
----------+-----------------------------------------------------------
        W |   2.82e+07           .           .           .           .
        B |          .     4303249           .           .           .
       AI |          .           .     1199118           .           .
       EA |          .           .           .     1642395           .
       PI |          .           .      95,702           .           .
        H |          .           .           .           .     4915281
        C |          .     289,980           .           .           .
       ME |    350,406           .           .           .           .
      SSA |          .     243,260           .           .           .
       SA |          .           .           .     349,010           .
----------------------------------------------------------------------

. table rancestry2 rancestry2s, missing

----------------------------------------------------------------------
rancestry |                        rancestry2s                        
2         |      White       Black  Indigenous       Asian      Latino
----------+-----------------------------------------------------------
        W |   1.26e+07           .           .           .           .
        B |          .      81,695           .           .           .
       AI |          .           .     770,322           .           .
       EA |          .           .           .     144,490           .
       PI |          .           .      21,999           .           .
        H |          .           .           .           .     272,661
        C |          .      31,616           .           .           .
       ME |     59,798           .           .           .           .
      SSA |          .      14,941           .           .           .
       SA |          .           .           .      15,232           .
----------------------------------------------------------------------

. table rancestry1s rancestry2s, missing

-----------------------------------------------------------------------
rancestry1 |                        rancestry2s                        
s          |      White       Black  Indigenous       Asian      Latino
-----------+-----------------------------------------------------------
     White |   1.20e+07      43,622     684,588      58,137     122,373
     Black |     59,070      37,515      62,647      11,265      24,707
Indigenous |    400,947      19,393       5,700      19,637      14,559
     Asian |     65,696       6,402      11,408      52,753      11,831
    Latino |    183,514      21,320      27,978      17,930      99,191
-----------------------------------------------------------------------

. table raceanc rancestry1s rancestry2s, missing

-----------------------------------------------------------------------
           |                rancestry2s and rancestry1s                
           | -------------------------- White -------------------------
   raceanc |      White       Black  Indigenous       Asian      Latino
-----------+-----------------------------------------------------------
     White |   1.20e+07           .           .           .           .
     Black |          .           .           .           .           .
Indigenous |          .           .           .           .           .
     Asian |          .           .           .           .           .
    Latino |          .           .           .           .           .
  Multiple |          .      59,070     400,947      65,696     183,514
-----------------------------------------------------------------------

-----------------------------------------------------------------------
           |                rancestry2s and rancestry1s                
           | -------------------------- Black -------------------------
   raceanc |      White       Black  Indigenous       Asian      Latino
-----------+-----------------------------------------------------------
     White |          .           .           .           .           .
     Black |          .      37,515           .           .           .
Indigenous |          .           .           .           .           .
     Asian |          .           .           .           .           .
    Latino |          .           .           .           .           .
  Multiple |     43,622           .      19,393       6,402      21,320
-----------------------------------------------------------------------

-----------------------------------------------------------------------
           |                rancestry2s and rancestry1s                
           | ----------------------- Indigenous -----------------------
   raceanc |      White       Black  Indigenous       Asian      Latino
-----------+-----------------------------------------------------------
     White |          .           .           .           .           .
     Black |          .           .           .           .           .
Indigenous |          .           .       5,700           .           .
     Asian |          .           .           .           .           .
    Latino |          .           .           .           .           .
  Multiple |    684,588      62,647           .      11,408      27,978
-----------------------------------------------------------------------

-----------------------------------------------------------------------
           |                rancestry2s and rancestry1s                
           | -------------------------- Asian -------------------------
   raceanc |      White       Black  Indigenous       Asian      Latino
-----------+-----------------------------------------------------------
     White |          .           .           .           .           .
     Black |          .           .           .           .           .
Indigenous |          .           .           .           .           .
     Asian |          .           .           .      52,753           .
    Latino |          .           .           .           .           .
  Multiple |     58,137      11,265      19,637           .      17,930
-----------------------------------------------------------------------

-----------------------------------------------------------------------
           |                rancestry2s and rancestry1s                
           | ------------------------- Latino -------------------------
   raceanc |      White       Black  Indigenous       Asian      Latino
-----------+-----------------------------------------------------------
     White |          .           .           .           .           .
     Black |          .           .           .           .           .
Indigenous |          .           .           .           .           .
     Asian |          .           .           .           .           .
    Latino |          .           .           .           .      99,191
  Multiple |    122,373      24,707      14,559      11,831           .
-----------------------------------------------------------------------

. table rancestry1, missing

----------------------
rancestry |
1         |      Freq.
----------+-----------
        W |   2.82e+07
        B |    4303249
       AI |    1199118
       EA |    1642395
       PI |     95,702
        H |    4915281
        C |    289,980
       ME |    350,406
      SSA |    243,260
       SA |    349,010
        A |    3786752
        M |    103,948
     None |    6614834
----------------------

. table rancestry2, missing

----------------------
rancestry |
2         |      Freq.
----------+-----------
        W |   1.26e+07
        B |     81,695
       AI |    770,322
       EA |    144,490
       PI |     21,999
        H |    272,661
        C |     31,616
       ME |     59,798
      SSA |     14,941
       SA |     15,232
        A |    127,545
        M |      4,387
     None |   3.79e+07
----------------------

. 
. //keep the variables I might need and save the full data at this point
. keep year yearint perwt samwt raceshort raceombd raceancd raceanc ancestr1 an
> cestr2 ancestr1d ancestr2d rancestry1 rancestry2 rancestry1s rancestry2s fore
> ign college female noancestry agectr agectrsq region

. save output/fulldata, replace
(note: file output/fulldata.dta not found)
file output/fulldata.dta saved

. 
. //Collapse to see the weighted counts for each category by period
. collapse (sum) samwt , by(raceombd raceancd yearint)

. save output/collapsed, replace
(note: file output/collapsed.dta not found)
file output/collapsed.dta saved

. 
. /********
> I also want to save the preliminary individual level data for the
> models. This data will need to be merged back with the aggregate data
> later to add in entropy scores before running models. But here, I can
> make all the necessary restrictions to make the data more manageable.
> ********/
. use output/fulldata, clear

. 
. //25+ age for 2000 and later
. drop if yearint<2000 | agectr<0
(24,846,025 observations deleted)

. //drop is missing dependent variable
. drop if college==.
(1 observation deleted)

. //Drop american, mixed, no ancestry and those with mixed big racial ancestrie
> s
. drop if raceanc==. | raceanc==6
(6,530,647 observations deleted)

. 
. keep yearint perwt agectr agectrsq foreign female region raceshort ancestr* r
> ancestry* college

. 
. //use saveold command so that R can read this data in
. saveold output/modeldata, replace v(12)
(saving in Stata 12 format, which can be read by Stata 11 or 12)
(note: file output/modeldata.dta not found)
file output/modeldata.dta saved

. 
. log close
      name:  <unnamed>
       log:  /home/aarong/Projects/GITHUB/essentialmeasures/logs/log_organizeda
> ta.txt
  log type:  text
 closed on:  16 Aug 2016, 10:16:09
-------------------------------------------------------------------------------
